luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxMc_reg.h
/** \brief  18, Error Tracking Register */
#define MC1_ETRR3 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0061118u)

/** \brief  1A, Error Tracking Register */
#define MC1_ETRR4 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF006111Au)

/** \brief  4, MBIST Control Register */
#define MC1_MCONTROL /*lint --e(923)*/ (*(volatile Ifx_MC_MCONTROL*)0xF0061104u)

/** \brief  6, Status Register */
#define MC1_MSTATUS /*lint --e(923)*/ (*(volatile Ifx_MC_MSTATUS*)0xF0061106u)

/** \brief  8, Range Register, single address mode */
#define MC1_RANGE /*lint --e(923)*/ (*(volatile Ifx_MC_RANGE*)0xF0061108u)

/** \brief  A0, Read Data and Bit Flip Register */
#define MC1_RDBFL0 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00611A0u)

/** \brief  A2, Read Data and Bit Flip Register */
#define MC1_RDBFL1 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00611A2u)

/** \brief  B4, Read Data and Bit Flip Register */
#define MC1_RDBFL10 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00611B4u)

/** \brief  B6, Read Data and Bit Flip Register */
#define MC1_RDBFL11 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00611B6u)

/** \brief  B8, Read Data and Bit Flip Register */
#define MC1_RDBFL12 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00611B8u)

/** \brief  BA, Read Data and Bit Flip Register */
#define MC1_RDBFL13 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00611BAu)

/** \brief  BC, Read Data and Bit Flip Register */
#define MC1_RDBFL14 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00611BCu)

/** \brief  BE, Read Data and Bit Flip Register */
#define MC1_RDBFL15 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00611BEu)

/** \brief  C0, Read Data and Bit Flip Register */
#define MC1_RDBFL16 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00611C0u)

/** \brief  C2, Read Data and Bit Flip Register */
#define MC1_RDBFL17 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00611C2u)

/** \brief  C4, Read Data and Bit Flip Register */
#define MC1_RDBFL18 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00611C4u)

/** \brief  C6, Read Data and Bit Flip Register */
#define MC1_RDBFL19 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00611C6u)

/** \brief  A4, Read Data and Bit Flip Register */
#define MC1_RDBFL2 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00611A4u)

/** \brief  C8, Read Data and Bit Flip Register */
#define MC1_RDBFL20 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00611C8u)

/** \brief  CA, Read Data and Bit Flip Register */
#define MC1_RDBFL21 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00611CAu)

/** \brief  CC, Read Data and Bit Flip Register */
#define MC1_RDBFL22 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00611CCu)

/** \brief  CE, Read Data and Bit Flip Register */
#define MC1_RDBFL23 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00611CEu)

/** \brief  D0, Read Data and Bit Flip Register */
#define MC1_RDBFL24 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00611D0u)

/** \brief  D2, Read Data and Bit Flip Register */
#define MC1_RDBFL25 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00611D2u)

/** \brief  D4, Read Data and Bit Flip Register */
#define MC1_RDBFL26 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00611D4u)

/** \brief  D6, Read Data and Bit Flip Register */
#define MC1_RDBFL27 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00611D6u)

/** \brief  D8, Read Data and Bit Flip Register */
#define MC1_RDBFL28 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00611D8u)

/** \brief  DA, Read Data and Bit Flip Register */
#define MC1_RDBFL29 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00611DAu)

/** \brief  A6, Read Data and Bit Flip Register */
#define MC1_RDBFL3 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00611A6u)

/** \brief  DC, Read Data and Bit Flip Register */
#define MC1_RDBFL30 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00611DCu)

/** \brief  DE, Read Data and Bit Flip Register */
#define MC1_RDBFL31 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00611DEu)

/** \brief  E0, Read Data and Bit Flip Register */
#define MC1_RDBFL32 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00611E0u)

/** \brief  E2, Read Data and Bit Flip Register */
#define MC1_RDBFL33 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00611E2u)

/** \brief  E4, Read Data and Bit Flip Register */
#define MC1_RDBFL34 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00611E4u)

/** \brief  E6, Read Data and Bit Flip Register */
#define MC1_RDBFL35 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00611E6u)

/** \brief  E8, Read Data and Bit Flip Register */
#define MC1_RDBFL36 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00611E8u)

/** \brief  EA, Read Data and Bit Flip Register */
#define MC1_RDBFL37 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00611EAu)

/** \brief  EC, Read Data and Bit Flip Register */
#define MC1_RDBFL38 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00611ECu)

/** \brief  EE, Read Data and Bit Flip Register */
#define MC1_RDBFL39 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00611EEu)

/** \brief  A8, Read Data and Bit Flip Register */
#define MC1_RDBFL4 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00611A8u)

/** \brief  AA, Read Data and Bit Flip Register */
#define MC1_RDBFL5 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00611AAu)

/** \brief  AC, Read Data and Bit Flip Register */
#define MC1_RDBFL6 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00611ACu)

/** \brief  AE, Read Data and Bit Flip Register */
#define MC1_RDBFL7 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00611AEu)

/** \brief  B0, Read Data and Bit Flip Register */
#define MC1_RDBFL8 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00611B0u)

/** \brief  B2, Read Data and Bit Flip Register */
#define MC1_RDBFL9 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00611B2u)

/** \brief  C, Revision ID Register */
#define MC1_REVID /*lint --e(923)*/ (*(volatile Ifx_MC_REVID*)0xF006110Cu)
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Mc_Cfg_Mc2
 * \{  */

/** \brief  0, Configuration Register 0 */
#define MC2_CONFIG0 /*lint --e(923)*/ (*(volatile Ifx_MC_CONFIG0*)0xF0061200u)

/** \brief  2, Configuration Register 1 */
#define MC2_CONFIG1 /*lint --e(923)*/ (*(volatile Ifx_MC_CONFIG1*)0xF0061202u)

/** \brief  10, Memory ECC Detection Register */
#define MC2_ECCD /*lint --e(923)*/ (*(volatile Ifx_MC_ECCD*)0xF0061210u)

/** \brief  E, ECC Safety Register */
#define MC2_ECCS /*lint --e(923)*/ (*(volatile Ifx_MC_ECCS*)0xF006120Eu)

/** \brief  12, Error Tracking Register */
#define MC2_ETRR0 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0061212u)

/** \brief  14, Error Tracking Register */
#define MC2_ETRR1 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0061214u)

/** \brief  16, Error Tracking Register */
#define MC2_ETRR2 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0061216u)

