luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxMc_reg.h
/** \brief  18, Error Tracking Register */
#define MC3_ETRR3 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0061318u)

/** \brief  1A, Error Tracking Register */
#define MC3_ETRR4 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF006131Au)

/** \brief  4, MBIST Control Register */
#define MC3_MCONTROL /*lint --e(923)*/ (*(volatile Ifx_MC_MCONTROL*)0xF0061304u)

/** \brief  6, Status Register */
#define MC3_MSTATUS /*lint --e(923)*/ (*(volatile Ifx_MC_MSTATUS*)0xF0061306u)

/** \brief  8, Range Register, single address mode */
#define MC3_RANGE /*lint --e(923)*/ (*(volatile Ifx_MC_RANGE*)0xF0061308u)

/** \brief  A0, Read Data and Bit Flip Register */
#define MC3_RDBFL0 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00613A0u)

/** \brief  A2, Read Data and Bit Flip Register */
#define MC3_RDBFL1 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00613A2u)

/** \brief  B4, Read Data and Bit Flip Register */
#define MC3_RDBFL10 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00613B4u)

/** \brief  B6, Read Data and Bit Flip Register */
#define MC3_RDBFL11 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00613B6u)

/** \brief  B8, Read Data and Bit Flip Register */
#define MC3_RDBFL12 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00613B8u)

/** \brief  BA, Read Data and Bit Flip Register */
#define MC3_RDBFL13 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00613BAu)

/** \brief  BC, Read Data and Bit Flip Register */
#define MC3_RDBFL14 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00613BCu)

/** \brief  BE, Read Data and Bit Flip Register */
#define MC3_RDBFL15 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00613BEu)

/** \brief  C0, Read Data and Bit Flip Register */
#define MC3_RDBFL16 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00613C0u)

/** \brief  C2, Read Data and Bit Flip Register */
#define MC3_RDBFL17 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00613C2u)

/** \brief  C4, Read Data and Bit Flip Register */
#define MC3_RDBFL18 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00613C4u)

/** \brief  C6, Read Data and Bit Flip Register */
#define MC3_RDBFL19 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00613C6u)

/** \brief  A4, Read Data and Bit Flip Register */
#define MC3_RDBFL2 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00613A4u)

/** \brief  C8, Read Data and Bit Flip Register */
#define MC3_RDBFL20 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00613C8u)

/** \brief  CA, Read Data and Bit Flip Register */
#define MC3_RDBFL21 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00613CAu)

/** \brief  CC, Read Data and Bit Flip Register */
#define MC3_RDBFL22 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00613CCu)

/** \brief  CE, Read Data and Bit Flip Register */
#define MC3_RDBFL23 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00613CEu)

/** \brief  D0, Read Data and Bit Flip Register */
#define MC3_RDBFL24 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00613D0u)

/** \brief  D2, Read Data and Bit Flip Register */
#define MC3_RDBFL25 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00613D2u)

/** \brief  D4, Read Data and Bit Flip Register */
#define MC3_RDBFL26 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00613D4u)

/** \brief  D6, Read Data and Bit Flip Register */
#define MC3_RDBFL27 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00613D6u)

/** \brief  D8, Read Data and Bit Flip Register */
#define MC3_RDBFL28 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00613D8u)

/** \brief  DA, Read Data and Bit Flip Register */
#define MC3_RDBFL29 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00613DAu)

/** \brief  A6, Read Data and Bit Flip Register */
#define MC3_RDBFL3 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00613A6u)

/** \brief  DC, Read Data and Bit Flip Register */
#define MC3_RDBFL30 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00613DCu)

/** \brief  DE, Read Data and Bit Flip Register */
#define MC3_RDBFL31 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00613DEu)

/** \brief  E0, Read Data and Bit Flip Register */
#define MC3_RDBFL32 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00613E0u)

/** \brief  E2, Read Data and Bit Flip Register */
#define MC3_RDBFL33 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00613E2u)

/** \brief  E4, Read Data and Bit Flip Register */
#define MC3_RDBFL34 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00613E4u)

/** \brief  E6, Read Data and Bit Flip Register */
#define MC3_RDBFL35 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00613E6u)

/** \brief  E8, Read Data and Bit Flip Register */
#define MC3_RDBFL36 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00613E8u)

/** \brief  EA, Read Data and Bit Flip Register */
#define MC3_RDBFL37 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00613EAu)

/** \brief  EC, Read Data and Bit Flip Register */
#define MC3_RDBFL38 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00613ECu)

/** \brief  EE, Read Data and Bit Flip Register */
#define MC3_RDBFL39 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00613EEu)

/** \brief  A8, Read Data and Bit Flip Register */
#define MC3_RDBFL4 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00613A8u)

/** \brief  AA, Read Data and Bit Flip Register */
#define MC3_RDBFL5 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00613AAu)

/** \brief  AC, Read Data and Bit Flip Register */
#define MC3_RDBFL6 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00613ACu)

/** \brief  AE, Read Data and Bit Flip Register */
#define MC3_RDBFL7 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00613AEu)

/** \brief  B0, Read Data and Bit Flip Register */
#define MC3_RDBFL8 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00613B0u)

/** \brief  B2, Read Data and Bit Flip Register */
#define MC3_RDBFL9 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00613B2u)

/** \brief  C, Revision ID Register */
#define MC3_REVID /*lint --e(923)*/ (*(volatile Ifx_MC_REVID*)0xF006130Cu)
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Mc_Cfg_Mc4
 * \{  */

/** \brief  0, Configuration Register 0 */
#define MC4_CONFIG0 /*lint --e(923)*/ (*(volatile Ifx_MC_CONFIG0*)0xF0061400u)

/** \brief  2, Configuration Register 1 */
#define MC4_CONFIG1 /*lint --e(923)*/ (*(volatile Ifx_MC_CONFIG1*)0xF0061402u)

/** \brief  10, Memory ECC Detection Register */
#define MC4_ECCD /*lint --e(923)*/ (*(volatile Ifx_MC_ECCD*)0xF0061410u)

/** \brief  E, ECC Safety Register */
#define MC4_ECCS /*lint --e(923)*/ (*(volatile Ifx_MC_ECCS*)0xF006140Eu)

/** \brief  12, Error Tracking Register */
#define MC4_ETRR0 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0061412u)

/** \brief  14, Error Tracking Register */
#define MC4_ETRR1 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0061414u)

/** \brief  16, Error Tracking Register */
#define MC4_ETRR2 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0061416u)

