luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxMc_reg.h
/** \brief  18, Error Tracking Register */
#define MC8_ETRR3 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0061818u)

/** \brief  1A, Error Tracking Register */
#define MC8_ETRR4 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF006181Au)

/** \brief  4, MBIST Control Register */
#define MC8_MCONTROL /*lint --e(923)*/ (*(volatile Ifx_MC_MCONTROL*)0xF0061804u)

/** \brief  6, Status Register */
#define MC8_MSTATUS /*lint --e(923)*/ (*(volatile Ifx_MC_MSTATUS*)0xF0061806u)

/** \brief  8, Range Register, single address mode */
#define MC8_RANGE /*lint --e(923)*/ (*(volatile Ifx_MC_RANGE*)0xF0061808u)

/** \brief  A0, Read Data and Bit Flip Register */
#define MC8_RDBFL0 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00618A0u)

/** \brief  A2, Read Data and Bit Flip Register */
#define MC8_RDBFL1 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00618A2u)

/** \brief  B4, Read Data and Bit Flip Register */
#define MC8_RDBFL10 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00618B4u)

/** \brief  B6, Read Data and Bit Flip Register */
#define MC8_RDBFL11 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00618B6u)

/** \brief  B8, Read Data and Bit Flip Register */
#define MC8_RDBFL12 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00618B8u)

/** \brief  BA, Read Data and Bit Flip Register */
#define MC8_RDBFL13 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00618BAu)

/** \brief  BC, Read Data and Bit Flip Register */
#define MC8_RDBFL14 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00618BCu)

/** \brief  BE, Read Data and Bit Flip Register */
#define MC8_RDBFL15 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00618BEu)

/** \brief  C0, Read Data and Bit Flip Register */
#define MC8_RDBFL16 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00618C0u)

/** \brief  C2, Read Data and Bit Flip Register */
#define MC8_RDBFL17 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00618C2u)

/** \brief  C4, Read Data and Bit Flip Register */
#define MC8_RDBFL18 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00618C4u)

/** \brief  C6, Read Data and Bit Flip Register */
#define MC8_RDBFL19 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00618C6u)

/** \brief  A4, Read Data and Bit Flip Register */
#define MC8_RDBFL2 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00618A4u)

/** \brief  C8, Read Data and Bit Flip Register */
#define MC8_RDBFL20 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00618C8u)

/** \brief  CA, Read Data and Bit Flip Register */
#define MC8_RDBFL21 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00618CAu)

/** \brief  CC, Read Data and Bit Flip Register */
#define MC8_RDBFL22 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00618CCu)

/** \brief  CE, Read Data and Bit Flip Register */
#define MC8_RDBFL23 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00618CEu)

/** \brief  D0, Read Data and Bit Flip Register */
#define MC8_RDBFL24 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00618D0u)

/** \brief  D2, Read Data and Bit Flip Register */
#define MC8_RDBFL25 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00618D2u)

/** \brief  D4, Read Data and Bit Flip Register */
#define MC8_RDBFL26 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00618D4u)

/** \brief  D6, Read Data and Bit Flip Register */
#define MC8_RDBFL27 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00618D6u)

/** \brief  D8, Read Data and Bit Flip Register */
#define MC8_RDBFL28 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00618D8u)

/** \brief  DA, Read Data and Bit Flip Register */
#define MC8_RDBFL29 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00618DAu)

/** \brief  A6, Read Data and Bit Flip Register */
#define MC8_RDBFL3 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00618A6u)

/** \brief  DC, Read Data and Bit Flip Register */
#define MC8_RDBFL30 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00618DCu)

/** \brief  DE, Read Data and Bit Flip Register */
#define MC8_RDBFL31 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00618DEu)

/** \brief  E0, Read Data and Bit Flip Register */
#define MC8_RDBFL32 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00618E0u)

/** \brief  E2, Read Data and Bit Flip Register */
#define MC8_RDBFL33 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00618E2u)

/** \brief  E4, Read Data and Bit Flip Register */
#define MC8_RDBFL34 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00618E4u)

/** \brief  E6, Read Data and Bit Flip Register */
#define MC8_RDBFL35 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00618E6u)

/** \brief  E8, Read Data and Bit Flip Register */
#define MC8_RDBFL36 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00618E8u)

/** \brief  EA, Read Data and Bit Flip Register */
#define MC8_RDBFL37 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00618EAu)

/** \brief  EC, Read Data and Bit Flip Register */
#define MC8_RDBFL38 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00618ECu)

/** \brief  EE, Read Data and Bit Flip Register */
#define MC8_RDBFL39 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00618EEu)

/** \brief  A8, Read Data and Bit Flip Register */
#define MC8_RDBFL4 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00618A8u)

/** \brief  AA, Read Data and Bit Flip Register */
#define MC8_RDBFL5 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00618AAu)

/** \brief  AC, Read Data and Bit Flip Register */
#define MC8_RDBFL6 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00618ACu)

/** \brief  AE, Read Data and Bit Flip Register */
#define MC8_RDBFL7 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00618AEu)

/** \brief  B0, Read Data and Bit Flip Register */
#define MC8_RDBFL8 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00618B0u)

/** \brief  B2, Read Data and Bit Flip Register */
#define MC8_RDBFL9 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00618B2u)

/** \brief  C, Revision ID Register */
#define MC8_REVID /*lint --e(923)*/ (*(volatile Ifx_MC_REVID*)0xF006180Cu)
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Mc_Cfg_Mc9
 * \{  */

/** \brief  0, Configuration Register 0 */
#define MC9_CONFIG0 /*lint --e(923)*/ (*(volatile Ifx_MC_CONFIG0*)0xF0061900u)

/** \brief  2, Configuration Register 1 */
#define MC9_CONFIG1 /*lint --e(923)*/ (*(volatile Ifx_MC_CONFIG1*)0xF0061902u)

/** \brief  10, Memory ECC Detection Register */
#define MC9_ECCD /*lint --e(923)*/ (*(volatile Ifx_MC_ECCD*)0xF0061910u)

/** \brief  E, ECC Safety Register */
#define MC9_ECCS /*lint --e(923)*/ (*(volatile Ifx_MC_ECCS*)0xF006190Eu)

/** \brief  12, Error Tracking Register */
#define MC9_ETRR0 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0061912u)

/** \brief  14, Error Tracking Register */
#define MC9_ETRR1 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0061914u)

/** \brief  16, Error Tracking Register */
#define MC9_ETRR2 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0061916u)

