luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxMc_reg.h
/** \brief  18, Error Tracking Register */
#define MC9_ETRR3 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0061918u)

/** \brief  1A, Error Tracking Register */
#define MC9_ETRR4 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF006191Au)

/** \brief  4, MBIST Control Register */
#define MC9_MCONTROL /*lint --e(923)*/ (*(volatile Ifx_MC_MCONTROL*)0xF0061904u)

/** \brief  6, Status Register */
#define MC9_MSTATUS /*lint --e(923)*/ (*(volatile Ifx_MC_MSTATUS*)0xF0061906u)

/** \brief  8, Range Register, single address mode */
#define MC9_RANGE /*lint --e(923)*/ (*(volatile Ifx_MC_RANGE*)0xF0061908u)

/** \brief  A0, Read Data and Bit Flip Register */
#define MC9_RDBFL0 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00619A0u)

/** \brief  A2, Read Data and Bit Flip Register */
#define MC9_RDBFL1 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00619A2u)

/** \brief  B4, Read Data and Bit Flip Register */
#define MC9_RDBFL10 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00619B4u)

/** \brief  B6, Read Data and Bit Flip Register */
#define MC9_RDBFL11 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00619B6u)

/** \brief  B8, Read Data and Bit Flip Register */
#define MC9_RDBFL12 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00619B8u)

/** \brief  BA, Read Data and Bit Flip Register */
#define MC9_RDBFL13 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00619BAu)

/** \brief  BC, Read Data and Bit Flip Register */
#define MC9_RDBFL14 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00619BCu)

/** \brief  BE, Read Data and Bit Flip Register */
#define MC9_RDBFL15 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00619BEu)

/** \brief  C0, Read Data and Bit Flip Register */
#define MC9_RDBFL16 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00619C0u)

/** \brief  C2, Read Data and Bit Flip Register */
#define MC9_RDBFL17 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00619C2u)

/** \brief  C4, Read Data and Bit Flip Register */
#define MC9_RDBFL18 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00619C4u)

/** \brief  C6, Read Data and Bit Flip Register */
#define MC9_RDBFL19 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00619C6u)

/** \brief  A4, Read Data and Bit Flip Register */
#define MC9_RDBFL2 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00619A4u)

/** \brief  C8, Read Data and Bit Flip Register */
#define MC9_RDBFL20 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00619C8u)

/** \brief  CA, Read Data and Bit Flip Register */
#define MC9_RDBFL21 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00619CAu)

/** \brief  CC, Read Data and Bit Flip Register */
#define MC9_RDBFL22 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00619CCu)

/** \brief  CE, Read Data and Bit Flip Register */
#define MC9_RDBFL23 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00619CEu)

/** \brief  D0, Read Data and Bit Flip Register */
#define MC9_RDBFL24 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00619D0u)

/** \brief  D2, Read Data and Bit Flip Register */
#define MC9_RDBFL25 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00619D2u)

/** \brief  D4, Read Data and Bit Flip Register */
#define MC9_RDBFL26 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00619D4u)

/** \brief  D6, Read Data and Bit Flip Register */
#define MC9_RDBFL27 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00619D6u)

/** \brief  D8, Read Data and Bit Flip Register */
#define MC9_RDBFL28 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00619D8u)

/** \brief  DA, Read Data and Bit Flip Register */
#define MC9_RDBFL29 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00619DAu)

/** \brief  A6, Read Data and Bit Flip Register */
#define MC9_RDBFL3 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00619A6u)

/** \brief  DC, Read Data and Bit Flip Register */
#define MC9_RDBFL30 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00619DCu)

/** \brief  DE, Read Data and Bit Flip Register */
#define MC9_RDBFL31 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00619DEu)

/** \brief  E0, Read Data and Bit Flip Register */
#define MC9_RDBFL32 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00619E0u)

/** \brief  E2, Read Data and Bit Flip Register */
#define MC9_RDBFL33 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00619E2u)

/** \brief  E4, Read Data and Bit Flip Register */
#define MC9_RDBFL34 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00619E4u)

/** \brief  E6, Read Data and Bit Flip Register */
#define MC9_RDBFL35 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00619E6u)

/** \brief  E8, Read Data and Bit Flip Register */
#define MC9_RDBFL36 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00619E8u)

/** \brief  EA, Read Data and Bit Flip Register */
#define MC9_RDBFL37 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00619EAu)

/** \brief  EC, Read Data and Bit Flip Register */
#define MC9_RDBFL38 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00619ECu)

/** \brief  EE, Read Data and Bit Flip Register */
#define MC9_RDBFL39 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00619EEu)

/** \brief  A8, Read Data and Bit Flip Register */
#define MC9_RDBFL4 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00619A8u)

/** \brief  AA, Read Data and Bit Flip Register */
#define MC9_RDBFL5 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00619AAu)

/** \brief  AC, Read Data and Bit Flip Register */
#define MC9_RDBFL6 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00619ACu)

/** \brief  AE, Read Data and Bit Flip Register */
#define MC9_RDBFL7 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00619AEu)

/** \brief  B0, Read Data and Bit Flip Register */
#define MC9_RDBFL8 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00619B0u)

/** \brief  B2, Read Data and Bit Flip Register */
#define MC9_RDBFL9 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00619B2u)

/** \brief  C, Revision ID Register */
#define MC9_REVID /*lint --e(923)*/ (*(volatile Ifx_MC_REVID*)0xF006190Cu)
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Mc_Cfg_Mc10
 * \{  */

/** \brief  0, Configuration Register 0 */
#define MC10_CONFIG0 /*lint --e(923)*/ (*(volatile Ifx_MC_CONFIG0*)0xF0061A00u)

/** \brief  2, Configuration Register 1 */
#define MC10_CONFIG1 /*lint --e(923)*/ (*(volatile Ifx_MC_CONFIG1*)0xF0061A02u)

/** \brief  10, Memory ECC Detection Register */
#define MC10_ECCD /*lint --e(923)*/ (*(volatile Ifx_MC_ECCD*)0xF0061A10u)

/** \brief  E, ECC Safety Register */
#define MC10_ECCS /*lint --e(923)*/ (*(volatile Ifx_MC_ECCS*)0xF0061A0Eu)

/** \brief  12, Error Tracking Register */
#define MC10_ETRR0 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0061A12u)

/** \brief  14, Error Tracking Register */
#define MC10_ETRR1 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0061A14u)

/** \brief  16, Error Tracking Register */
#define MC10_ETRR2 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0061A16u)

