luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxMc_reg.h
/** \brief  18, Error Tracking Register */
#define MC13_ETRR3 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0061D18u)

/** \brief  1A, Error Tracking Register */
#define MC13_ETRR4 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0061D1Au)

/** \brief  4, MBIST Control Register */
#define MC13_MCONTROL /*lint --e(923)*/ (*(volatile Ifx_MC_MCONTROL*)0xF0061D04u)

/** \brief  6, Status Register */
#define MC13_MSTATUS /*lint --e(923)*/ (*(volatile Ifx_MC_MSTATUS*)0xF0061D06u)

/** \brief  8, Range Register, single address mode */
#define MC13_RANGE /*lint --e(923)*/ (*(volatile Ifx_MC_RANGE*)0xF0061D08u)

/** \brief  A0, Read Data and Bit Flip Register */
#define MC13_RDBFL0 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061DA0u)

/** \brief  A2, Read Data and Bit Flip Register */
#define MC13_RDBFL1 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061DA2u)

/** \brief  B4, Read Data and Bit Flip Register */
#define MC13_RDBFL10 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061DB4u)

/** \brief  B6, Read Data and Bit Flip Register */
#define MC13_RDBFL11 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061DB6u)

/** \brief  B8, Read Data and Bit Flip Register */
#define MC13_RDBFL12 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061DB8u)

/** \brief  BA, Read Data and Bit Flip Register */
#define MC13_RDBFL13 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061DBAu)

/** \brief  BC, Read Data and Bit Flip Register */
#define MC13_RDBFL14 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061DBCu)

/** \brief  BE, Read Data and Bit Flip Register */
#define MC13_RDBFL15 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061DBEu)

/** \brief  C0, Read Data and Bit Flip Register */
#define MC13_RDBFL16 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061DC0u)

/** \brief  C2, Read Data and Bit Flip Register */
#define MC13_RDBFL17 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061DC2u)

/** \brief  C4, Read Data and Bit Flip Register */
#define MC13_RDBFL18 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061DC4u)

/** \brief  C6, Read Data and Bit Flip Register */
#define MC13_RDBFL19 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061DC6u)

/** \brief  A4, Read Data and Bit Flip Register */
#define MC13_RDBFL2 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061DA4u)

/** \brief  C8, Read Data and Bit Flip Register */
#define MC13_RDBFL20 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061DC8u)

/** \brief  CA, Read Data and Bit Flip Register */
#define MC13_RDBFL21 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061DCAu)

/** \brief  CC, Read Data and Bit Flip Register */
#define MC13_RDBFL22 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061DCCu)

/** \brief  CE, Read Data and Bit Flip Register */
#define MC13_RDBFL23 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061DCEu)

/** \brief  D0, Read Data and Bit Flip Register */
#define MC13_RDBFL24 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061DD0u)

/** \brief  D2, Read Data and Bit Flip Register */
#define MC13_RDBFL25 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061DD2u)

/** \brief  D4, Read Data and Bit Flip Register */
#define MC13_RDBFL26 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061DD4u)

/** \brief  D6, Read Data and Bit Flip Register */
#define MC13_RDBFL27 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061DD6u)

/** \brief  D8, Read Data and Bit Flip Register */
#define MC13_RDBFL28 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061DD8u)

/** \brief  DA, Read Data and Bit Flip Register */
#define MC13_RDBFL29 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061DDAu)

/** \brief  A6, Read Data and Bit Flip Register */
#define MC13_RDBFL3 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061DA6u)

/** \brief  DC, Read Data and Bit Flip Register */
#define MC13_RDBFL30 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061DDCu)

/** \brief  DE, Read Data and Bit Flip Register */
#define MC13_RDBFL31 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061DDEu)

/** \brief  E0, Read Data and Bit Flip Register */
#define MC13_RDBFL32 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061DE0u)

/** \brief  E2, Read Data and Bit Flip Register */
#define MC13_RDBFL33 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061DE2u)

/** \brief  E4, Read Data and Bit Flip Register */
#define MC13_RDBFL34 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061DE4u)

/** \brief  E6, Read Data and Bit Flip Register */
#define MC13_RDBFL35 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061DE6u)

/** \brief  E8, Read Data and Bit Flip Register */
#define MC13_RDBFL36 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061DE8u)

/** \brief  EA, Read Data and Bit Flip Register */
#define MC13_RDBFL37 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061DEAu)

/** \brief  EC, Read Data and Bit Flip Register */
#define MC13_RDBFL38 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061DECu)

/** \brief  EE, Read Data and Bit Flip Register */
#define MC13_RDBFL39 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061DEEu)

/** \brief  A8, Read Data and Bit Flip Register */
#define MC13_RDBFL4 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061DA8u)

/** \brief  AA, Read Data and Bit Flip Register */
#define MC13_RDBFL5 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061DAAu)

/** \brief  AC, Read Data and Bit Flip Register */
#define MC13_RDBFL6 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061DACu)

/** \brief  AE, Read Data and Bit Flip Register */
#define MC13_RDBFL7 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061DAEu)

/** \brief  B0, Read Data and Bit Flip Register */
#define MC13_RDBFL8 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061DB0u)

/** \brief  B2, Read Data and Bit Flip Register */
#define MC13_RDBFL9 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061DB2u)

/** \brief  C, Revision ID Register */
#define MC13_REVID /*lint --e(923)*/ (*(volatile Ifx_MC_REVID*)0xF0061D0Cu)
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Mc_Cfg_Mc14
 * \{  */

/** \brief  0, Configuration Register 0 */
#define MC14_CONFIG0 /*lint --e(923)*/ (*(volatile Ifx_MC_CONFIG0*)0xF0061E00u)

/** \brief  2, Configuration Register 1 */
#define MC14_CONFIG1 /*lint --e(923)*/ (*(volatile Ifx_MC_CONFIG1*)0xF0061E02u)

/** \brief  10, Memory ECC Detection Register */
#define MC14_ECCD /*lint --e(923)*/ (*(volatile Ifx_MC_ECCD*)0xF0061E10u)

/** \brief  E, ECC Safety Register */
#define MC14_ECCS /*lint --e(923)*/ (*(volatile Ifx_MC_ECCS*)0xF0061E0Eu)

/** \brief  12, Error Tracking Register */
#define MC14_ETRR0 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0061E12u)

/** \brief  14, Error Tracking Register */
#define MC14_ETRR1 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0061E14u)

/** \brief  16, Error Tracking Register */
#define MC14_ETRR2 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0061E16u)

