luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxMc_reg.h
/** \brief  18, Error Tracking Register */
#define MC15_ETRR3 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0061F18u)

/** \brief  1A, Error Tracking Register */
#define MC15_ETRR4 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0061F1Au)

/** \brief  4, MBIST Control Register */
#define MC15_MCONTROL /*lint --e(923)*/ (*(volatile Ifx_MC_MCONTROL*)0xF0061F04u)

/** \brief  6, Status Register */
#define MC15_MSTATUS /*lint --e(923)*/ (*(volatile Ifx_MC_MSTATUS*)0xF0061F06u)

/** \brief  8, Range Register, single address mode */
#define MC15_RANGE /*lint --e(923)*/ (*(volatile Ifx_MC_RANGE*)0xF0061F08u)

/** \brief  A0, Read Data and Bit Flip Register */
#define MC15_RDBFL0 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061FA0u)

/** \brief  A2, Read Data and Bit Flip Register */
#define MC15_RDBFL1 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061FA2u)

/** \brief  B4, Read Data and Bit Flip Register */
#define MC15_RDBFL10 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061FB4u)

/** \brief  B6, Read Data and Bit Flip Register */
#define MC15_RDBFL11 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061FB6u)

/** \brief  B8, Read Data and Bit Flip Register */
#define MC15_RDBFL12 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061FB8u)

/** \brief  BA, Read Data and Bit Flip Register */
#define MC15_RDBFL13 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061FBAu)

/** \brief  BC, Read Data and Bit Flip Register */
#define MC15_RDBFL14 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061FBCu)

/** \brief  BE, Read Data and Bit Flip Register */
#define MC15_RDBFL15 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061FBEu)

/** \brief  C0, Read Data and Bit Flip Register */
#define MC15_RDBFL16 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061FC0u)

/** \brief  C2, Read Data and Bit Flip Register */
#define MC15_RDBFL17 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061FC2u)

/** \brief  C4, Read Data and Bit Flip Register */
#define MC15_RDBFL18 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061FC4u)

/** \brief  C6, Read Data and Bit Flip Register */
#define MC15_RDBFL19 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061FC6u)

/** \brief  A4, Read Data and Bit Flip Register */
#define MC15_RDBFL2 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061FA4u)

/** \brief  C8, Read Data and Bit Flip Register */
#define MC15_RDBFL20 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061FC8u)

/** \brief  CA, Read Data and Bit Flip Register */
#define MC15_RDBFL21 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061FCAu)

/** \brief  CC, Read Data and Bit Flip Register */
#define MC15_RDBFL22 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061FCCu)

/** \brief  CE, Read Data and Bit Flip Register */
#define MC15_RDBFL23 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061FCEu)

/** \brief  D0, Read Data and Bit Flip Register */
#define MC15_RDBFL24 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061FD0u)

/** \brief  D2, Read Data and Bit Flip Register */
#define MC15_RDBFL25 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061FD2u)

/** \brief  D4, Read Data and Bit Flip Register */
#define MC15_RDBFL26 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061FD4u)

/** \brief  D6, Read Data and Bit Flip Register */
#define MC15_RDBFL27 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061FD6u)

/** \brief  D8, Read Data and Bit Flip Register */
#define MC15_RDBFL28 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061FD8u)

/** \brief  DA, Read Data and Bit Flip Register */
#define MC15_RDBFL29 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061FDAu)

/** \brief  A6, Read Data and Bit Flip Register */
#define MC15_RDBFL3 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061FA6u)

/** \brief  DC, Read Data and Bit Flip Register */
#define MC15_RDBFL30 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061FDCu)

/** \brief  DE, Read Data and Bit Flip Register */
#define MC15_RDBFL31 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061FDEu)

/** \brief  E0, Read Data and Bit Flip Register */
#define MC15_RDBFL32 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061FE0u)

/** \brief  E2, Read Data and Bit Flip Register */
#define MC15_RDBFL33 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061FE2u)

/** \brief  E4, Read Data and Bit Flip Register */
#define MC15_RDBFL34 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061FE4u)

/** \brief  E6, Read Data and Bit Flip Register */
#define MC15_RDBFL35 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061FE6u)

/** \brief  E8, Read Data and Bit Flip Register */
#define MC15_RDBFL36 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061FE8u)

/** \brief  EA, Read Data and Bit Flip Register */
#define MC15_RDBFL37 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061FEAu)

/** \brief  EC, Read Data and Bit Flip Register */
#define MC15_RDBFL38 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061FECu)

/** \brief  EE, Read Data and Bit Flip Register */
#define MC15_RDBFL39 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061FEEu)

/** \brief  A8, Read Data and Bit Flip Register */
#define MC15_RDBFL4 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061FA8u)

/** \brief  AA, Read Data and Bit Flip Register */
#define MC15_RDBFL5 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061FAAu)

/** \brief  AC, Read Data and Bit Flip Register */
#define MC15_RDBFL6 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061FACu)

/** \brief  AE, Read Data and Bit Flip Register */
#define MC15_RDBFL7 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061FAEu)

/** \brief  B0, Read Data and Bit Flip Register */
#define MC15_RDBFL8 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061FB0u)

/** \brief  B2, Read Data and Bit Flip Register */
#define MC15_RDBFL9 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061FB2u)

/** \brief  C, Revision ID Register */
#define MC15_REVID /*lint --e(923)*/ (*(volatile Ifx_MC_REVID*)0xF0061F0Cu)
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Mc_Cfg_Mc16
 * \{  */

/** \brief  0, Configuration Register 0 */
#define MC16_CONFIG0 /*lint --e(923)*/ (*(volatile Ifx_MC_CONFIG0*)0xF0062000u)

/** \brief  2, Configuration Register 1 */
#define MC16_CONFIG1 /*lint --e(923)*/ (*(volatile Ifx_MC_CONFIG1*)0xF0062002u)

/** \brief  10, Memory ECC Detection Register */
#define MC16_ECCD /*lint --e(923)*/ (*(volatile Ifx_MC_ECCD*)0xF0062010u)

/** \brief  E, ECC Safety Register */
#define MC16_ECCS /*lint --e(923)*/ (*(volatile Ifx_MC_ECCS*)0xF006200Eu)

/** \brief  12, Error Tracking Register */
#define MC16_ETRR0 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0062012u)

/** \brief  14, Error Tracking Register */
#define MC16_ETRR1 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0062014u)

/** \brief  16, Error Tracking Register */
#define MC16_ETRR2 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0062016u)

