luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxMc_reg.h
/** \brief  18, Error Tracking Register */
#define MC25_ETRR3 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0062918u)

/** \brief  1A, Error Tracking Register */
#define MC25_ETRR4 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF006291Au)

/** \brief  4, MBIST Control Register */
#define MC25_MCONTROL /*lint --e(923)*/ (*(volatile Ifx_MC_MCONTROL*)0xF0062904u)

/** \brief  6, Status Register */
#define MC25_MSTATUS /*lint --e(923)*/ (*(volatile Ifx_MC_MSTATUS*)0xF0062906u)

/** \brief  8, Range Register, single address mode */
#define MC25_RANGE /*lint --e(923)*/ (*(volatile Ifx_MC_RANGE*)0xF0062908u)

/** \brief  A0, Read Data and Bit Flip Register */
#define MC25_RDBFL0 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00629A0u)

/** \brief  A2, Read Data and Bit Flip Register */
#define MC25_RDBFL1 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00629A2u)

/** \brief  B4, Read Data and Bit Flip Register */
#define MC25_RDBFL10 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00629B4u)

/** \brief  B6, Read Data and Bit Flip Register */
#define MC25_RDBFL11 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00629B6u)

/** \brief  B8, Read Data and Bit Flip Register */
#define MC25_RDBFL12 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00629B8u)

/** \brief  BA, Read Data and Bit Flip Register */
#define MC25_RDBFL13 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00629BAu)

/** \brief  BC, Read Data and Bit Flip Register */
#define MC25_RDBFL14 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00629BCu)

/** \brief  BE, Read Data and Bit Flip Register */
#define MC25_RDBFL15 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00629BEu)

/** \brief  C0, Read Data and Bit Flip Register */
#define MC25_RDBFL16 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00629C0u)

/** \brief  C2, Read Data and Bit Flip Register */
#define MC25_RDBFL17 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00629C2u)

/** \brief  C4, Read Data and Bit Flip Register */
#define MC25_RDBFL18 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00629C4u)

/** \brief  C6, Read Data and Bit Flip Register */
#define MC25_RDBFL19 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00629C6u)

/** \brief  A4, Read Data and Bit Flip Register */
#define MC25_RDBFL2 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00629A4u)

/** \brief  C8, Read Data and Bit Flip Register */
#define MC25_RDBFL20 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00629C8u)

/** \brief  CA, Read Data and Bit Flip Register */
#define MC25_RDBFL21 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00629CAu)

/** \brief  CC, Read Data and Bit Flip Register */
#define MC25_RDBFL22 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00629CCu)

/** \brief  CE, Read Data and Bit Flip Register */
#define MC25_RDBFL23 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00629CEu)

/** \brief  D0, Read Data and Bit Flip Register */
#define MC25_RDBFL24 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00629D0u)

/** \brief  D2, Read Data and Bit Flip Register */
#define MC25_RDBFL25 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00629D2u)

/** \brief  D4, Read Data and Bit Flip Register */
#define MC25_RDBFL26 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00629D4u)

/** \brief  D6, Read Data and Bit Flip Register */
#define MC25_RDBFL27 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00629D6u)

/** \brief  D8, Read Data and Bit Flip Register */
#define MC25_RDBFL28 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00629D8u)

/** \brief  DA, Read Data and Bit Flip Register */
#define MC25_RDBFL29 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00629DAu)

/** \brief  A6, Read Data and Bit Flip Register */
#define MC25_RDBFL3 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00629A6u)

/** \brief  DC, Read Data and Bit Flip Register */
#define MC25_RDBFL30 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00629DCu)

/** \brief  DE, Read Data and Bit Flip Register */
#define MC25_RDBFL31 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00629DEu)

/** \brief  E0, Read Data and Bit Flip Register */
#define MC25_RDBFL32 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00629E0u)

/** \brief  E2, Read Data and Bit Flip Register */
#define MC25_RDBFL33 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00629E2u)

/** \brief  E4, Read Data and Bit Flip Register */
#define MC25_RDBFL34 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00629E4u)

/** \brief  E6, Read Data and Bit Flip Register */
#define MC25_RDBFL35 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00629E6u)

/** \brief  E8, Read Data and Bit Flip Register */
#define MC25_RDBFL36 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00629E8u)

/** \brief  EA, Read Data and Bit Flip Register */
#define MC25_RDBFL37 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00629EAu)

/** \brief  EC, Read Data and Bit Flip Register */
#define MC25_RDBFL38 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00629ECu)

/** \brief  EE, Read Data and Bit Flip Register */
#define MC25_RDBFL39 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00629EEu)

/** \brief  A8, Read Data and Bit Flip Register */
#define MC25_RDBFL4 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00629A8u)

/** \brief  AA, Read Data and Bit Flip Register */
#define MC25_RDBFL5 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00629AAu)

/** \brief  AC, Read Data and Bit Flip Register */
#define MC25_RDBFL6 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00629ACu)

/** \brief  AE, Read Data and Bit Flip Register */
#define MC25_RDBFL7 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00629AEu)

/** \brief  B0, Read Data and Bit Flip Register */
#define MC25_RDBFL8 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00629B0u)

/** \brief  B2, Read Data and Bit Flip Register */
#define MC25_RDBFL9 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00629B2u)

/** \brief  C, Revision ID Register */
#define MC25_REVID /*lint --e(923)*/ (*(volatile Ifx_MC_REVID*)0xF006290Cu)
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Mc_Cfg_Mc26
 * \{  */

/** \brief  0, Configuration Register 0 */
#define MC26_CONFIG0 /*lint --e(923)*/ (*(volatile Ifx_MC_CONFIG0*)0xF0062A00u)

/** \brief  2, Configuration Register 1 */
#define MC26_CONFIG1 /*lint --e(923)*/ (*(volatile Ifx_MC_CONFIG1*)0xF0062A02u)

/** \brief  10, Memory ECC Detection Register */
#define MC26_ECCD /*lint --e(923)*/ (*(volatile Ifx_MC_ECCD*)0xF0062A10u)

/** \brief  E, ECC Safety Register */
#define MC26_ECCS /*lint --e(923)*/ (*(volatile Ifx_MC_ECCS*)0xF0062A0Eu)

/** \brief  12, Error Tracking Register */
#define MC26_ETRR0 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0062A12u)

/** \brief  14, Error Tracking Register */
#define MC26_ETRR1 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0062A14u)

/** \brief  16, Error Tracking Register */
#define MC26_ETRR2 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0062A16u)

