luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxMc_reg.h
/** \brief  18, Error Tracking Register */
#define MC33_ETRR3 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0063118u)

/** \brief  1A, Error Tracking Register */
#define MC33_ETRR4 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF006311Au)

/** \brief  4, MBIST Control Register */
#define MC33_MCONTROL /*lint --e(923)*/ (*(volatile Ifx_MC_MCONTROL*)0xF0063104u)

/** \brief  6, Status Register */
#define MC33_MSTATUS /*lint --e(923)*/ (*(volatile Ifx_MC_MSTATUS*)0xF0063106u)

/** \brief  8, Range Register, single address mode */
#define MC33_RANGE /*lint --e(923)*/ (*(volatile Ifx_MC_RANGE*)0xF0063108u)

/** \brief  A0, Read Data and Bit Flip Register */
#define MC33_RDBFL0 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00631A0u)

/** \brief  A2, Read Data and Bit Flip Register */
#define MC33_RDBFL1 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00631A2u)

/** \brief  B4, Read Data and Bit Flip Register */
#define MC33_RDBFL10 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00631B4u)

/** \brief  B6, Read Data and Bit Flip Register */
#define MC33_RDBFL11 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00631B6u)

/** \brief  B8, Read Data and Bit Flip Register */
#define MC33_RDBFL12 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00631B8u)

/** \brief  BA, Read Data and Bit Flip Register */
#define MC33_RDBFL13 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00631BAu)

/** \brief  BC, Read Data and Bit Flip Register */
#define MC33_RDBFL14 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00631BCu)

/** \brief  BE, Read Data and Bit Flip Register */
#define MC33_RDBFL15 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00631BEu)

/** \brief  C0, Read Data and Bit Flip Register */
#define MC33_RDBFL16 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00631C0u)

/** \brief  C2, Read Data and Bit Flip Register */
#define MC33_RDBFL17 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00631C2u)

/** \brief  C4, Read Data and Bit Flip Register */
#define MC33_RDBFL18 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00631C4u)

/** \brief  C6, Read Data and Bit Flip Register */
#define MC33_RDBFL19 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00631C6u)

/** \brief  A4, Read Data and Bit Flip Register */
#define MC33_RDBFL2 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00631A4u)

/** \brief  C8, Read Data and Bit Flip Register */
#define MC33_RDBFL20 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00631C8u)

/** \brief  CA, Read Data and Bit Flip Register */
#define MC33_RDBFL21 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00631CAu)

/** \brief  CC, Read Data and Bit Flip Register */
#define MC33_RDBFL22 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00631CCu)

/** \brief  CE, Read Data and Bit Flip Register */
#define MC33_RDBFL23 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00631CEu)

/** \brief  D0, Read Data and Bit Flip Register */
#define MC33_RDBFL24 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00631D0u)

/** \brief  D2, Read Data and Bit Flip Register */
#define MC33_RDBFL25 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00631D2u)

/** \brief  D4, Read Data and Bit Flip Register */
#define MC33_RDBFL26 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00631D4u)

/** \brief  D6, Read Data and Bit Flip Register */
#define MC33_RDBFL27 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00631D6u)

/** \brief  D8, Read Data and Bit Flip Register */
#define MC33_RDBFL28 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00631D8u)

/** \brief  DA, Read Data and Bit Flip Register */
#define MC33_RDBFL29 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00631DAu)

/** \brief  A6, Read Data and Bit Flip Register */
#define MC33_RDBFL3 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00631A6u)

/** \brief  DC, Read Data and Bit Flip Register */
#define MC33_RDBFL30 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00631DCu)

/** \brief  DE, Read Data and Bit Flip Register */
#define MC33_RDBFL31 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00631DEu)

/** \brief  E0, Read Data and Bit Flip Register */
#define MC33_RDBFL32 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00631E0u)

/** \brief  E2, Read Data and Bit Flip Register */
#define MC33_RDBFL33 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00631E2u)

/** \brief  E4, Read Data and Bit Flip Register */
#define MC33_RDBFL34 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00631E4u)

/** \brief  E6, Read Data and Bit Flip Register */
#define MC33_RDBFL35 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00631E6u)

/** \brief  E8, Read Data and Bit Flip Register */
#define MC33_RDBFL36 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00631E8u)

/** \brief  EA, Read Data and Bit Flip Register */
#define MC33_RDBFL37 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00631EAu)

/** \brief  EC, Read Data and Bit Flip Register */
#define MC33_RDBFL38 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00631ECu)

/** \brief  EE, Read Data and Bit Flip Register */
#define MC33_RDBFL39 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00631EEu)

/** \brief  A8, Read Data and Bit Flip Register */
#define MC33_RDBFL4 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00631A8u)

/** \brief  AA, Read Data and Bit Flip Register */
#define MC33_RDBFL5 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00631AAu)

/** \brief  AC, Read Data and Bit Flip Register */
#define MC33_RDBFL6 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00631ACu)

/** \brief  AE, Read Data and Bit Flip Register */
#define MC33_RDBFL7 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00631AEu)

/** \brief  B0, Read Data and Bit Flip Register */
#define MC33_RDBFL8 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00631B0u)

/** \brief  B2, Read Data and Bit Flip Register */
#define MC33_RDBFL9 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00631B2u)

/** \brief  C, Revision ID Register */
#define MC33_REVID /*lint --e(923)*/ (*(volatile Ifx_MC_REVID*)0xF006310Cu)
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Mc_Cfg_Mc34
 * \{  */

/** \brief  0, Configuration Register 0 */
#define MC34_CONFIG0 /*lint --e(923)*/ (*(volatile Ifx_MC_CONFIG0*)0xF0063200u)

/** \brief  2, Configuration Register 1 */
#define MC34_CONFIG1 /*lint --e(923)*/ (*(volatile Ifx_MC_CONFIG1*)0xF0063202u)

/** \brief  10, Memory ECC Detection Register */
#define MC34_ECCD /*lint --e(923)*/ (*(volatile Ifx_MC_ECCD*)0xF0063210u)

/** \brief  E, ECC Safety Register */
#define MC34_ECCS /*lint --e(923)*/ (*(volatile Ifx_MC_ECCS*)0xF006320Eu)

/** \brief  12, Error Tracking Register */
#define MC34_ETRR0 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0063212u)

/** \brief  14, Error Tracking Register */
#define MC34_ETRR1 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0063214u)

/** \brief  16, Error Tracking Register */
#define MC34_ETRR2 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0063216u)

