luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxMc_reg.h
/** \brief  18, Error Tracking Register */
#define MC35_ETRR3 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0063318u)

/** \brief  1A, Error Tracking Register */
#define MC35_ETRR4 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF006331Au)

/** \brief  4, MBIST Control Register */
#define MC35_MCONTROL /*lint --e(923)*/ (*(volatile Ifx_MC_MCONTROL*)0xF0063304u)

/** \brief  6, Status Register */
#define MC35_MSTATUS /*lint --e(923)*/ (*(volatile Ifx_MC_MSTATUS*)0xF0063306u)

/** \brief  8, Range Register, single address mode */
#define MC35_RANGE /*lint --e(923)*/ (*(volatile Ifx_MC_RANGE*)0xF0063308u)

/** \brief  A0, Read Data and Bit Flip Register */
#define MC35_RDBFL0 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00633A0u)

/** \brief  A2, Read Data and Bit Flip Register */
#define MC35_RDBFL1 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00633A2u)

/** \brief  B4, Read Data and Bit Flip Register */
#define MC35_RDBFL10 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00633B4u)

/** \brief  B6, Read Data and Bit Flip Register */
#define MC35_RDBFL11 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00633B6u)

/** \brief  B8, Read Data and Bit Flip Register */
#define MC35_RDBFL12 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00633B8u)

/** \brief  BA, Read Data and Bit Flip Register */
#define MC35_RDBFL13 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00633BAu)

/** \brief  BC, Read Data and Bit Flip Register */
#define MC35_RDBFL14 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00633BCu)

/** \brief  BE, Read Data and Bit Flip Register */
#define MC35_RDBFL15 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00633BEu)

/** \brief  C0, Read Data and Bit Flip Register */
#define MC35_RDBFL16 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00633C0u)

/** \brief  C2, Read Data and Bit Flip Register */
#define MC35_RDBFL17 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00633C2u)

/** \brief  C4, Read Data and Bit Flip Register */
#define MC35_RDBFL18 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00633C4u)

/** \brief  C6, Read Data and Bit Flip Register */
#define MC35_RDBFL19 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00633C6u)

/** \brief  A4, Read Data and Bit Flip Register */
#define MC35_RDBFL2 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00633A4u)

/** \brief  C8, Read Data and Bit Flip Register */
#define MC35_RDBFL20 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00633C8u)

/** \brief  CA, Read Data and Bit Flip Register */
#define MC35_RDBFL21 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00633CAu)

/** \brief  CC, Read Data and Bit Flip Register */
#define MC35_RDBFL22 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00633CCu)

/** \brief  CE, Read Data and Bit Flip Register */
#define MC35_RDBFL23 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00633CEu)

/** \brief  D0, Read Data and Bit Flip Register */
#define MC35_RDBFL24 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00633D0u)

/** \brief  D2, Read Data and Bit Flip Register */
#define MC35_RDBFL25 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00633D2u)

/** \brief  D4, Read Data and Bit Flip Register */
#define MC35_RDBFL26 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00633D4u)

/** \brief  D6, Read Data and Bit Flip Register */
#define MC35_RDBFL27 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00633D6u)

/** \brief  D8, Read Data and Bit Flip Register */
#define MC35_RDBFL28 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00633D8u)

/** \brief  DA, Read Data and Bit Flip Register */
#define MC35_RDBFL29 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00633DAu)

/** \brief  A6, Read Data and Bit Flip Register */
#define MC35_RDBFL3 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00633A6u)

/** \brief  DC, Read Data and Bit Flip Register */
#define MC35_RDBFL30 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00633DCu)

/** \brief  DE, Read Data and Bit Flip Register */
#define MC35_RDBFL31 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00633DEu)

/** \brief  E0, Read Data and Bit Flip Register */
#define MC35_RDBFL32 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00633E0u)

/** \brief  E2, Read Data and Bit Flip Register */
#define MC35_RDBFL33 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00633E2u)

/** \brief  E4, Read Data and Bit Flip Register */
#define MC35_RDBFL34 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00633E4u)

/** \brief  E6, Read Data and Bit Flip Register */
#define MC35_RDBFL35 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00633E6u)

/** \brief  E8, Read Data and Bit Flip Register */
#define MC35_RDBFL36 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00633E8u)

/** \brief  EA, Read Data and Bit Flip Register */
#define MC35_RDBFL37 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00633EAu)

/** \brief  EC, Read Data and Bit Flip Register */
#define MC35_RDBFL38 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00633ECu)

/** \brief  EE, Read Data and Bit Flip Register */
#define MC35_RDBFL39 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00633EEu)

/** \brief  A8, Read Data and Bit Flip Register */
#define MC35_RDBFL4 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00633A8u)

/** \brief  AA, Read Data and Bit Flip Register */
#define MC35_RDBFL5 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00633AAu)

/** \brief  AC, Read Data and Bit Flip Register */
#define MC35_RDBFL6 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00633ACu)

/** \brief  AE, Read Data and Bit Flip Register */
#define MC35_RDBFL7 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00633AEu)

/** \brief  B0, Read Data and Bit Flip Register */
#define MC35_RDBFL8 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00633B0u)

/** \brief  B2, Read Data and Bit Flip Register */
#define MC35_RDBFL9 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00633B2u)

/** \brief  C, Revision ID Register */
#define MC35_REVID /*lint --e(923)*/ (*(volatile Ifx_MC_REVID*)0xF006330Cu)
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Mc_Cfg_Mc36
 * \{  */

/** \brief  0, Configuration Register 0 */
#define MC36_CONFIG0 /*lint --e(923)*/ (*(volatile Ifx_MC_CONFIG0*)0xF0063400u)

/** \brief  2, Configuration Register 1 */
#define MC36_CONFIG1 /*lint --e(923)*/ (*(volatile Ifx_MC_CONFIG1*)0xF0063402u)

/** \brief  10, Memory ECC Detection Register */
#define MC36_ECCD /*lint --e(923)*/ (*(volatile Ifx_MC_ECCD*)0xF0063410u)

/** \brief  E, ECC Safety Register */
#define MC36_ECCS /*lint --e(923)*/ (*(volatile Ifx_MC_ECCS*)0xF006340Eu)

/** \brief  12, Error Tracking Register */
#define MC36_ETRR0 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0063412u)

/** \brief  14, Error Tracking Register */
#define MC36_ETRR1 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0063414u)

/** \brief  16, Error Tracking Register */
#define MC36_ETRR2 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0063416u)

