luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxMc_reg.h
/** \brief  18, Error Tracking Register */
#define MC42_ETRR3 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0063A18u)

/** \brief  1A, Error Tracking Register */
#define MC42_ETRR4 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0063A1Au)

/** \brief  4, MBIST Control Register */
#define MC42_MCONTROL /*lint --e(923)*/ (*(volatile Ifx_MC_MCONTROL*)0xF0063A04u)

/** \brief  6, Status Register */
#define MC42_MSTATUS /*lint --e(923)*/ (*(volatile Ifx_MC_MSTATUS*)0xF0063A06u)

/** \brief  8, Range Register, single address mode */
#define MC42_RANGE /*lint --e(923)*/ (*(volatile Ifx_MC_RANGE*)0xF0063A08u)

/** \brief  A0, Read Data and Bit Flip Register */
#define MC42_RDBFL0 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063AA0u)

/** \brief  A2, Read Data and Bit Flip Register */
#define MC42_RDBFL1 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063AA2u)

/** \brief  B4, Read Data and Bit Flip Register */
#define MC42_RDBFL10 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063AB4u)

/** \brief  B6, Read Data and Bit Flip Register */
#define MC42_RDBFL11 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063AB6u)

/** \brief  B8, Read Data and Bit Flip Register */
#define MC42_RDBFL12 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063AB8u)

/** \brief  BA, Read Data and Bit Flip Register */
#define MC42_RDBFL13 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063ABAu)

/** \brief  BC, Read Data and Bit Flip Register */
#define MC42_RDBFL14 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063ABCu)

/** \brief  BE, Read Data and Bit Flip Register */
#define MC42_RDBFL15 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063ABEu)

/** \brief  C0, Read Data and Bit Flip Register */
#define MC42_RDBFL16 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063AC0u)

/** \brief  C2, Read Data and Bit Flip Register */
#define MC42_RDBFL17 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063AC2u)

/** \brief  C4, Read Data and Bit Flip Register */
#define MC42_RDBFL18 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063AC4u)

/** \brief  C6, Read Data and Bit Flip Register */
#define MC42_RDBFL19 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063AC6u)

/** \brief  A4, Read Data and Bit Flip Register */
#define MC42_RDBFL2 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063AA4u)

/** \brief  C8, Read Data and Bit Flip Register */
#define MC42_RDBFL20 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063AC8u)

/** \brief  CA, Read Data and Bit Flip Register */
#define MC42_RDBFL21 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063ACAu)

/** \brief  CC, Read Data and Bit Flip Register */
#define MC42_RDBFL22 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063ACCu)

/** \brief  CE, Read Data and Bit Flip Register */
#define MC42_RDBFL23 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063ACEu)

/** \brief  D0, Read Data and Bit Flip Register */
#define MC42_RDBFL24 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063AD0u)

/** \brief  D2, Read Data and Bit Flip Register */
#define MC42_RDBFL25 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063AD2u)

/** \brief  D4, Read Data and Bit Flip Register */
#define MC42_RDBFL26 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063AD4u)

/** \brief  D6, Read Data and Bit Flip Register */
#define MC42_RDBFL27 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063AD6u)

/** \brief  D8, Read Data and Bit Flip Register */
#define MC42_RDBFL28 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063AD8u)

/** \brief  DA, Read Data and Bit Flip Register */
#define MC42_RDBFL29 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063ADAu)

/** \brief  A6, Read Data and Bit Flip Register */
#define MC42_RDBFL3 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063AA6u)

/** \brief  DC, Read Data and Bit Flip Register */
#define MC42_RDBFL30 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063ADCu)

/** \brief  DE, Read Data and Bit Flip Register */
#define MC42_RDBFL31 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063ADEu)

/** \brief  E0, Read Data and Bit Flip Register */
#define MC42_RDBFL32 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063AE0u)

/** \brief  E2, Read Data and Bit Flip Register */
#define MC42_RDBFL33 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063AE2u)

/** \brief  E4, Read Data and Bit Flip Register */
#define MC42_RDBFL34 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063AE4u)

/** \brief  E6, Read Data and Bit Flip Register */
#define MC42_RDBFL35 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063AE6u)

/** \brief  E8, Read Data and Bit Flip Register */
#define MC42_RDBFL36 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063AE8u)

/** \brief  EA, Read Data and Bit Flip Register */
#define MC42_RDBFL37 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063AEAu)

/** \brief  EC, Read Data and Bit Flip Register */
#define MC42_RDBFL38 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063AECu)

/** \brief  EE, Read Data and Bit Flip Register */
#define MC42_RDBFL39 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063AEEu)

/** \brief  A8, Read Data and Bit Flip Register */
#define MC42_RDBFL4 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063AA8u)

/** \brief  AA, Read Data and Bit Flip Register */
#define MC42_RDBFL5 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063AAAu)

/** \brief  AC, Read Data and Bit Flip Register */
#define MC42_RDBFL6 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063AACu)

/** \brief  AE, Read Data and Bit Flip Register */
#define MC42_RDBFL7 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063AAEu)

/** \brief  B0, Read Data and Bit Flip Register */
#define MC42_RDBFL8 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063AB0u)

/** \brief  B2, Read Data and Bit Flip Register */
#define MC42_RDBFL9 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063AB2u)

/** \brief  C, Revision ID Register */
#define MC42_REVID /*lint --e(923)*/ (*(volatile Ifx_MC_REVID*)0xF0063A0Cu)
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Mc_Cfg_Mc43
 * \{  */

/** \brief  0, Configuration Register 0 */
#define MC43_CONFIG0 /*lint --e(923)*/ (*(volatile Ifx_MC_CONFIG0*)0xF0063B00u)

/** \brief  2, Configuration Register 1 */
#define MC43_CONFIG1 /*lint --e(923)*/ (*(volatile Ifx_MC_CONFIG1*)0xF0063B02u)

/** \brief  10, Memory ECC Detection Register */
#define MC43_ECCD /*lint --e(923)*/ (*(volatile Ifx_MC_ECCD*)0xF0063B10u)

/** \brief  E, ECC Safety Register */
#define MC43_ECCS /*lint --e(923)*/ (*(volatile Ifx_MC_ECCS*)0xF0063B0Eu)

/** \brief  12, Error Tracking Register */
#define MC43_ETRR0 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0063B12u)

/** \brief  14, Error Tracking Register */
#define MC43_ETRR1 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0063B14u)

/** \brief  16, Error Tracking Register */
#define MC43_ETRR2 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0063B16u)

