luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxMc_reg.h
/** \brief  18, Error Tracking Register */
#define MC45_ETRR3 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0063D18u)

/** \brief  1A, Error Tracking Register */
#define MC45_ETRR4 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0063D1Au)

/** \brief  4, MBIST Control Register */
#define MC45_MCONTROL /*lint --e(923)*/ (*(volatile Ifx_MC_MCONTROL*)0xF0063D04u)

/** \brief  6, Status Register */
#define MC45_MSTATUS /*lint --e(923)*/ (*(volatile Ifx_MC_MSTATUS*)0xF0063D06u)

/** \brief  8, Range Register, single address mode */
#define MC45_RANGE /*lint --e(923)*/ (*(volatile Ifx_MC_RANGE*)0xF0063D08u)

/** \brief  A0, Read Data and Bit Flip Register */
#define MC45_RDBFL0 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063DA0u)

/** \brief  A2, Read Data and Bit Flip Register */
#define MC45_RDBFL1 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063DA2u)

/** \brief  B4, Read Data and Bit Flip Register */
#define MC45_RDBFL10 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063DB4u)

/** \brief  B6, Read Data and Bit Flip Register */
#define MC45_RDBFL11 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063DB6u)

/** \brief  B8, Read Data and Bit Flip Register */
#define MC45_RDBFL12 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063DB8u)

/** \brief  BA, Read Data and Bit Flip Register */
#define MC45_RDBFL13 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063DBAu)

/** \brief  BC, Read Data and Bit Flip Register */
#define MC45_RDBFL14 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063DBCu)

/** \brief  BE, Read Data and Bit Flip Register */
#define MC45_RDBFL15 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063DBEu)

/** \brief  C0, Read Data and Bit Flip Register */
#define MC45_RDBFL16 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063DC0u)

/** \brief  C2, Read Data and Bit Flip Register */
#define MC45_RDBFL17 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063DC2u)

/** \brief  C4, Read Data and Bit Flip Register */
#define MC45_RDBFL18 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063DC4u)

/** \brief  C6, Read Data and Bit Flip Register */
#define MC45_RDBFL19 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063DC6u)

/** \brief  A4, Read Data and Bit Flip Register */
#define MC45_RDBFL2 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063DA4u)

/** \brief  C8, Read Data and Bit Flip Register */
#define MC45_RDBFL20 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063DC8u)

/** \brief  CA, Read Data and Bit Flip Register */
#define MC45_RDBFL21 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063DCAu)

/** \brief  CC, Read Data and Bit Flip Register */
#define MC45_RDBFL22 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063DCCu)

/** \brief  CE, Read Data and Bit Flip Register */
#define MC45_RDBFL23 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063DCEu)

/** \brief  D0, Read Data and Bit Flip Register */
#define MC45_RDBFL24 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063DD0u)

/** \brief  D2, Read Data and Bit Flip Register */
#define MC45_RDBFL25 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063DD2u)

/** \brief  D4, Read Data and Bit Flip Register */
#define MC45_RDBFL26 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063DD4u)

/** \brief  D6, Read Data and Bit Flip Register */
#define MC45_RDBFL27 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063DD6u)

/** \brief  D8, Read Data and Bit Flip Register */
#define MC45_RDBFL28 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063DD8u)

/** \brief  DA, Read Data and Bit Flip Register */
#define MC45_RDBFL29 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063DDAu)

/** \brief  A6, Read Data and Bit Flip Register */
#define MC45_RDBFL3 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063DA6u)

/** \brief  DC, Read Data and Bit Flip Register */
#define MC45_RDBFL30 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063DDCu)

/** \brief  DE, Read Data and Bit Flip Register */
#define MC45_RDBFL31 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063DDEu)

/** \brief  E0, Read Data and Bit Flip Register */
#define MC45_RDBFL32 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063DE0u)

/** \brief  E2, Read Data and Bit Flip Register */
#define MC45_RDBFL33 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063DE2u)

/** \brief  E4, Read Data and Bit Flip Register */
#define MC45_RDBFL34 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063DE4u)

/** \brief  E6, Read Data and Bit Flip Register */
#define MC45_RDBFL35 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063DE6u)

/** \brief  E8, Read Data and Bit Flip Register */
#define MC45_RDBFL36 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063DE8u)

/** \brief  EA, Read Data and Bit Flip Register */
#define MC45_RDBFL37 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063DEAu)

/** \brief  EC, Read Data and Bit Flip Register */
#define MC45_RDBFL38 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063DECu)

/** \brief  EE, Read Data and Bit Flip Register */
#define MC45_RDBFL39 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063DEEu)

/** \brief  A8, Read Data and Bit Flip Register */
#define MC45_RDBFL4 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063DA8u)

/** \brief  AA, Read Data and Bit Flip Register */
#define MC45_RDBFL5 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063DAAu)

/** \brief  AC, Read Data and Bit Flip Register */
#define MC45_RDBFL6 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063DACu)

/** \brief  AE, Read Data and Bit Flip Register */
#define MC45_RDBFL7 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063DAEu)

/** \brief  B0, Read Data and Bit Flip Register */
#define MC45_RDBFL8 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063DB0u)

/** \brief  B2, Read Data and Bit Flip Register */
#define MC45_RDBFL9 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063DB2u)

/** \brief  C, Revision ID Register */
#define MC45_REVID /*lint --e(923)*/ (*(volatile Ifx_MC_REVID*)0xF0063D0Cu)
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Mc_Cfg_Mc46
 * \{  */

/** \brief  0, Configuration Register 0 */
#define MC46_CONFIG0 /*lint --e(923)*/ (*(volatile Ifx_MC_CONFIG0*)0xF0063E00u)

/** \brief  2, Configuration Register 1 */
#define MC46_CONFIG1 /*lint --e(923)*/ (*(volatile Ifx_MC_CONFIG1*)0xF0063E02u)

/** \brief  10, Memory ECC Detection Register */
#define MC46_ECCD /*lint --e(923)*/ (*(volatile Ifx_MC_ECCD*)0xF0063E10u)

/** \brief  E, ECC Safety Register */
#define MC46_ECCS /*lint --e(923)*/ (*(volatile Ifx_MC_ECCS*)0xF0063E0Eu)

/** \brief  12, Error Tracking Register */
#define MC46_ETRR0 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0063E12u)

/** \brief  14, Error Tracking Register */
#define MC46_ETRR1 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0063E14u)

/** \brief  16, Error Tracking Register */
#define MC46_ETRR2 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0063E16u)

