luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxMc_reg.h
/** \brief  18, Error Tracking Register */
#define MC46_ETRR3 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0063E18u)

/** \brief  1A, Error Tracking Register */
#define MC46_ETRR4 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0063E1Au)

/** \brief  4, MBIST Control Register */
#define MC46_MCONTROL /*lint --e(923)*/ (*(volatile Ifx_MC_MCONTROL*)0xF0063E04u)

/** \brief  6, Status Register */
#define MC46_MSTATUS /*lint --e(923)*/ (*(volatile Ifx_MC_MSTATUS*)0xF0063E06u)

/** \brief  8, Range Register, single address mode */
#define MC46_RANGE /*lint --e(923)*/ (*(volatile Ifx_MC_RANGE*)0xF0063E08u)

/** \brief  A0, Read Data and Bit Flip Register */
#define MC46_RDBFL0 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063EA0u)

/** \brief  A2, Read Data and Bit Flip Register */
#define MC46_RDBFL1 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063EA2u)

/** \brief  B4, Read Data and Bit Flip Register */
#define MC46_RDBFL10 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063EB4u)

/** \brief  B6, Read Data and Bit Flip Register */
#define MC46_RDBFL11 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063EB6u)

/** \brief  B8, Read Data and Bit Flip Register */
#define MC46_RDBFL12 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063EB8u)

/** \brief  BA, Read Data and Bit Flip Register */
#define MC46_RDBFL13 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063EBAu)

/** \brief  BC, Read Data and Bit Flip Register */
#define MC46_RDBFL14 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063EBCu)

/** \brief  BE, Read Data and Bit Flip Register */
#define MC46_RDBFL15 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063EBEu)

/** \brief  C0, Read Data and Bit Flip Register */
#define MC46_RDBFL16 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063EC0u)

/** \brief  C2, Read Data and Bit Flip Register */
#define MC46_RDBFL17 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063EC2u)

/** \brief  C4, Read Data and Bit Flip Register */
#define MC46_RDBFL18 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063EC4u)

/** \brief  C6, Read Data and Bit Flip Register */
#define MC46_RDBFL19 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063EC6u)

/** \brief  A4, Read Data and Bit Flip Register */
#define MC46_RDBFL2 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063EA4u)

/** \brief  C8, Read Data and Bit Flip Register */
#define MC46_RDBFL20 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063EC8u)

/** \brief  CA, Read Data and Bit Flip Register */
#define MC46_RDBFL21 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063ECAu)

/** \brief  CC, Read Data and Bit Flip Register */
#define MC46_RDBFL22 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063ECCu)

/** \brief  CE, Read Data and Bit Flip Register */
#define MC46_RDBFL23 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063ECEu)

/** \brief  D0, Read Data and Bit Flip Register */
#define MC46_RDBFL24 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063ED0u)

/** \brief  D2, Read Data and Bit Flip Register */
#define MC46_RDBFL25 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063ED2u)

/** \brief  D4, Read Data and Bit Flip Register */
#define MC46_RDBFL26 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063ED4u)

/** \brief  D6, Read Data and Bit Flip Register */
#define MC46_RDBFL27 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063ED6u)

/** \brief  D8, Read Data and Bit Flip Register */
#define MC46_RDBFL28 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063ED8u)

/** \brief  DA, Read Data and Bit Flip Register */
#define MC46_RDBFL29 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063EDAu)

/** \brief  A6, Read Data and Bit Flip Register */
#define MC46_RDBFL3 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063EA6u)

/** \brief  DC, Read Data and Bit Flip Register */
#define MC46_RDBFL30 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063EDCu)

/** \brief  DE, Read Data and Bit Flip Register */
#define MC46_RDBFL31 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063EDEu)

/** \brief  E0, Read Data and Bit Flip Register */
#define MC46_RDBFL32 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063EE0u)

/** \brief  E2, Read Data and Bit Flip Register */
#define MC46_RDBFL33 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063EE2u)

/** \brief  E4, Read Data and Bit Flip Register */
#define MC46_RDBFL34 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063EE4u)

/** \brief  E6, Read Data and Bit Flip Register */
#define MC46_RDBFL35 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063EE6u)

/** \brief  E8, Read Data and Bit Flip Register */
#define MC46_RDBFL36 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063EE8u)

/** \brief  EA, Read Data and Bit Flip Register */
#define MC46_RDBFL37 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063EEAu)

/** \brief  EC, Read Data and Bit Flip Register */
#define MC46_RDBFL38 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063EECu)

/** \brief  EE, Read Data and Bit Flip Register */
#define MC46_RDBFL39 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063EEEu)

/** \brief  A8, Read Data and Bit Flip Register */
#define MC46_RDBFL4 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063EA8u)

/** \brief  AA, Read Data and Bit Flip Register */
#define MC46_RDBFL5 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063EAAu)

/** \brief  AC, Read Data and Bit Flip Register */
#define MC46_RDBFL6 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063EACu)

/** \brief  AE, Read Data and Bit Flip Register */
#define MC46_RDBFL7 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063EAEu)

/** \brief  B0, Read Data and Bit Flip Register */
#define MC46_RDBFL8 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063EB0u)

/** \brief  B2, Read Data and Bit Flip Register */
#define MC46_RDBFL9 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063EB2u)

/** \brief  C, Revision ID Register */
#define MC46_REVID /*lint --e(923)*/ (*(volatile Ifx_MC_REVID*)0xF0063E0Cu)
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Mc_Cfg_Mc47
 * \{  */

/** \brief  0, Configuration Register 0 */
#define MC47_CONFIG0 /*lint --e(923)*/ (*(volatile Ifx_MC_CONFIG0*)0xF0063F00u)

/** \brief  2, Configuration Register 1 */
#define MC47_CONFIG1 /*lint --e(923)*/ (*(volatile Ifx_MC_CONFIG1*)0xF0063F02u)

/** \brief  10, Memory ECC Detection Register */
#define MC47_ECCD /*lint --e(923)*/ (*(volatile Ifx_MC_ECCD*)0xF0063F10u)

/** \brief  E, ECC Safety Register */
#define MC47_ECCS /*lint --e(923)*/ (*(volatile Ifx_MC_ECCS*)0xF0063F0Eu)

/** \brief  12, Error Tracking Register */
#define MC47_ETRR0 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0063F12u)

/** \brief  14, Error Tracking Register */
#define MC47_ETRR1 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0063F14u)

/** \brief  16, Error Tracking Register */
#define MC47_ETRR2 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0063F16u)

