luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxMc_reg.h
/** \brief  18, Error Tracking Register */
#define MC47_ETRR3 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0063F18u)

/** \brief  1A, Error Tracking Register */
#define MC47_ETRR4 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0063F1Au)

/** \brief  4, MBIST Control Register */
#define MC47_MCONTROL /*lint --e(923)*/ (*(volatile Ifx_MC_MCONTROL*)0xF0063F04u)

/** \brief  6, Status Register */
#define MC47_MSTATUS /*lint --e(923)*/ (*(volatile Ifx_MC_MSTATUS*)0xF0063F06u)

/** \brief  8, Range Register, single address mode */
#define MC47_RANGE /*lint --e(923)*/ (*(volatile Ifx_MC_RANGE*)0xF0063F08u)

/** \brief  A0, Read Data and Bit Flip Register */
#define MC47_RDBFL0 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063FA0u)

/** \brief  A2, Read Data and Bit Flip Register */
#define MC47_RDBFL1 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063FA2u)

/** \brief  B4, Read Data and Bit Flip Register */
#define MC47_RDBFL10 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063FB4u)

/** \brief  B6, Read Data and Bit Flip Register */
#define MC47_RDBFL11 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063FB6u)

/** \brief  B8, Read Data and Bit Flip Register */
#define MC47_RDBFL12 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063FB8u)

/** \brief  BA, Read Data and Bit Flip Register */
#define MC47_RDBFL13 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063FBAu)

/** \brief  BC, Read Data and Bit Flip Register */
#define MC47_RDBFL14 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063FBCu)

/** \brief  BE, Read Data and Bit Flip Register */
#define MC47_RDBFL15 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063FBEu)

/** \brief  C0, Read Data and Bit Flip Register */
#define MC47_RDBFL16 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063FC0u)

/** \brief  C2, Read Data and Bit Flip Register */
#define MC47_RDBFL17 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063FC2u)

/** \brief  C4, Read Data and Bit Flip Register */
#define MC47_RDBFL18 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063FC4u)

/** \brief  C6, Read Data and Bit Flip Register */
#define MC47_RDBFL19 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063FC6u)

/** \brief  A4, Read Data and Bit Flip Register */
#define MC47_RDBFL2 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063FA4u)

/** \brief  C8, Read Data and Bit Flip Register */
#define MC47_RDBFL20 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063FC8u)

/** \brief  CA, Read Data and Bit Flip Register */
#define MC47_RDBFL21 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063FCAu)

/** \brief  CC, Read Data and Bit Flip Register */
#define MC47_RDBFL22 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063FCCu)

/** \brief  CE, Read Data and Bit Flip Register */
#define MC47_RDBFL23 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063FCEu)

/** \brief  D0, Read Data and Bit Flip Register */
#define MC47_RDBFL24 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063FD0u)

/** \brief  D2, Read Data and Bit Flip Register */
#define MC47_RDBFL25 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063FD2u)

/** \brief  D4, Read Data and Bit Flip Register */
#define MC47_RDBFL26 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063FD4u)

/** \brief  D6, Read Data and Bit Flip Register */
#define MC47_RDBFL27 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063FD6u)

/** \brief  D8, Read Data and Bit Flip Register */
#define MC47_RDBFL28 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063FD8u)

/** \brief  DA, Read Data and Bit Flip Register */
#define MC47_RDBFL29 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063FDAu)

/** \brief  A6, Read Data and Bit Flip Register */
#define MC47_RDBFL3 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063FA6u)

/** \brief  DC, Read Data and Bit Flip Register */
#define MC47_RDBFL30 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063FDCu)

/** \brief  DE, Read Data and Bit Flip Register */
#define MC47_RDBFL31 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063FDEu)

/** \brief  E0, Read Data and Bit Flip Register */
#define MC47_RDBFL32 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063FE0u)

/** \brief  E2, Read Data and Bit Flip Register */
#define MC47_RDBFL33 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063FE2u)

/** \brief  E4, Read Data and Bit Flip Register */
#define MC47_RDBFL34 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063FE4u)

/** \brief  E6, Read Data and Bit Flip Register */
#define MC47_RDBFL35 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063FE6u)

/** \brief  E8, Read Data and Bit Flip Register */
#define MC47_RDBFL36 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063FE8u)

/** \brief  EA, Read Data and Bit Flip Register */
#define MC47_RDBFL37 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063FEAu)

/** \brief  EC, Read Data and Bit Flip Register */
#define MC47_RDBFL38 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063FECu)

/** \brief  EE, Read Data and Bit Flip Register */
#define MC47_RDBFL39 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063FEEu)

/** \brief  A8, Read Data and Bit Flip Register */
#define MC47_RDBFL4 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063FA8u)

/** \brief  AA, Read Data and Bit Flip Register */
#define MC47_RDBFL5 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063FAAu)

/** \brief  AC, Read Data and Bit Flip Register */
#define MC47_RDBFL6 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063FACu)

/** \brief  AE, Read Data and Bit Flip Register */
#define MC47_RDBFL7 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063FAEu)

/** \brief  B0, Read Data and Bit Flip Register */
#define MC47_RDBFL8 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063FB0u)

/** \brief  B2, Read Data and Bit Flip Register */
#define MC47_RDBFL9 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063FB2u)

/** \brief  C, Revision ID Register */
#define MC47_REVID /*lint --e(923)*/ (*(volatile Ifx_MC_REVID*)0xF0063F0Cu)
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Mc_Cfg_Mc48
 * \{  */

/** \brief  0, Configuration Register 0 */
#define MC48_CONFIG0 /*lint --e(923)*/ (*(volatile Ifx_MC_CONFIG0*)0xF0064000u)

/** \brief  2, Configuration Register 1 */
#define MC48_CONFIG1 /*lint --e(923)*/ (*(volatile Ifx_MC_CONFIG1*)0xF0064002u)

/** \brief  10, Memory ECC Detection Register */
#define MC48_ECCD /*lint --e(923)*/ (*(volatile Ifx_MC_ECCD*)0xF0064010u)

/** \brief  E, ECC Safety Register */
#define MC48_ECCS /*lint --e(923)*/ (*(volatile Ifx_MC_ECCS*)0xF006400Eu)

/** \brief  12, Error Tracking Register */
#define MC48_ETRR0 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0064012u)

/** \brief  14, Error Tracking Register */
#define MC48_ETRR1 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0064014u)

/** \brief  16, Error Tracking Register */
#define MC48_ETRR2 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0064016u)

