luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxMc_reg.h
/** \brief  18, Error Tracking Register */
#define MC48_ETRR3 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0064018u)

/** \brief  1A, Error Tracking Register */
#define MC48_ETRR4 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF006401Au)

/** \brief  4, MBIST Control Register */
#define MC48_MCONTROL /*lint --e(923)*/ (*(volatile Ifx_MC_MCONTROL*)0xF0064004u)

/** \brief  6, Status Register */
#define MC48_MSTATUS /*lint --e(923)*/ (*(volatile Ifx_MC_MSTATUS*)0xF0064006u)

/** \brief  8, Range Register, single address mode */
#define MC48_RANGE /*lint --e(923)*/ (*(volatile Ifx_MC_RANGE*)0xF0064008u)

/** \brief  A0, Read Data and Bit Flip Register */
#define MC48_RDBFL0 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00640A0u)

/** \brief  A2, Read Data and Bit Flip Register */
#define MC48_RDBFL1 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00640A2u)

/** \brief  B4, Read Data and Bit Flip Register */
#define MC48_RDBFL10 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00640B4u)

/** \brief  B6, Read Data and Bit Flip Register */
#define MC48_RDBFL11 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00640B6u)

/** \brief  B8, Read Data and Bit Flip Register */
#define MC48_RDBFL12 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00640B8u)

/** \brief  BA, Read Data and Bit Flip Register */
#define MC48_RDBFL13 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00640BAu)

/** \brief  BC, Read Data and Bit Flip Register */
#define MC48_RDBFL14 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00640BCu)

/** \brief  BE, Read Data and Bit Flip Register */
#define MC48_RDBFL15 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00640BEu)

/** \brief  C0, Read Data and Bit Flip Register */
#define MC48_RDBFL16 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00640C0u)

/** \brief  C2, Read Data and Bit Flip Register */
#define MC48_RDBFL17 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00640C2u)

/** \brief  C4, Read Data and Bit Flip Register */
#define MC48_RDBFL18 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00640C4u)

/** \brief  C6, Read Data and Bit Flip Register */
#define MC48_RDBFL19 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00640C6u)

/** \brief  A4, Read Data and Bit Flip Register */
#define MC48_RDBFL2 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00640A4u)

/** \brief  C8, Read Data and Bit Flip Register */
#define MC48_RDBFL20 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00640C8u)

/** \brief  CA, Read Data and Bit Flip Register */
#define MC48_RDBFL21 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00640CAu)

/** \brief  CC, Read Data and Bit Flip Register */
#define MC48_RDBFL22 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00640CCu)

/** \brief  CE, Read Data and Bit Flip Register */
#define MC48_RDBFL23 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00640CEu)

/** \brief  D0, Read Data and Bit Flip Register */
#define MC48_RDBFL24 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00640D0u)

/** \brief  D2, Read Data and Bit Flip Register */
#define MC48_RDBFL25 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00640D2u)

/** \brief  D4, Read Data and Bit Flip Register */
#define MC48_RDBFL26 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00640D4u)

/** \brief  D6, Read Data and Bit Flip Register */
#define MC48_RDBFL27 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00640D6u)

/** \brief  D8, Read Data and Bit Flip Register */
#define MC48_RDBFL28 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00640D8u)

/** \brief  DA, Read Data and Bit Flip Register */
#define MC48_RDBFL29 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00640DAu)

/** \brief  A6, Read Data and Bit Flip Register */
#define MC48_RDBFL3 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00640A6u)

/** \brief  DC, Read Data and Bit Flip Register */
#define MC48_RDBFL30 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00640DCu)

/** \brief  DE, Read Data and Bit Flip Register */
#define MC48_RDBFL31 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00640DEu)

/** \brief  E0, Read Data and Bit Flip Register */
#define MC48_RDBFL32 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00640E0u)

/** \brief  E2, Read Data and Bit Flip Register */
#define MC48_RDBFL33 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00640E2u)

/** \brief  E4, Read Data and Bit Flip Register */
#define MC48_RDBFL34 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00640E4u)

/** \brief  E6, Read Data and Bit Flip Register */
#define MC48_RDBFL35 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00640E6u)

/** \brief  E8, Read Data and Bit Flip Register */
#define MC48_RDBFL36 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00640E8u)

/** \brief  EA, Read Data and Bit Flip Register */
#define MC48_RDBFL37 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00640EAu)

/** \brief  EC, Read Data and Bit Flip Register */
#define MC48_RDBFL38 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00640ECu)

/** \brief  EE, Read Data and Bit Flip Register */
#define MC48_RDBFL39 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00640EEu)

/** \brief  A8, Read Data and Bit Flip Register */
#define MC48_RDBFL4 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00640A8u)

/** \brief  AA, Read Data and Bit Flip Register */
#define MC48_RDBFL5 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00640AAu)

/** \brief  AC, Read Data and Bit Flip Register */
#define MC48_RDBFL6 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00640ACu)

/** \brief  AE, Read Data and Bit Flip Register */
#define MC48_RDBFL7 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00640AEu)

/** \brief  B0, Read Data and Bit Flip Register */
#define MC48_RDBFL8 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00640B0u)

/** \brief  B2, Read Data and Bit Flip Register */
#define MC48_RDBFL9 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00640B2u)

/** \brief  C, Revision ID Register */
#define MC48_REVID /*lint --e(923)*/ (*(volatile Ifx_MC_REVID*)0xF006400Cu)
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Mc_Cfg_Mc49
 * \{  */

/** \brief  0, Configuration Register 0 */
#define MC49_CONFIG0 /*lint --e(923)*/ (*(volatile Ifx_MC_CONFIG0*)0xF0064100u)

/** \brief  2, Configuration Register 1 */
#define MC49_CONFIG1 /*lint --e(923)*/ (*(volatile Ifx_MC_CONFIG1*)0xF0064102u)

/** \brief  10, Memory ECC Detection Register */
#define MC49_ECCD /*lint --e(923)*/ (*(volatile Ifx_MC_ECCD*)0xF0064110u)

/** \brief  E, ECC Safety Register */
#define MC49_ECCS /*lint --e(923)*/ (*(volatile Ifx_MC_ECCS*)0xF006410Eu)

/** \brief  12, Error Tracking Register */
#define MC49_ETRR0 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0064112u)

/** \brief  14, Error Tracking Register */
#define MC49_ETRR1 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0064114u)

/** \brief  16, Error Tracking Register */
#define MC49_ETRR2 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0064116u)

