luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxMc_reg.h
/** \brief  18, Error Tracking Register */
#define MC54_ETRR3 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0064618u)

/** \brief  1A, Error Tracking Register */
#define MC54_ETRR4 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF006461Au)

/** \brief  4, MBIST Control Register */
#define MC54_MCONTROL /*lint --e(923)*/ (*(volatile Ifx_MC_MCONTROL*)0xF0064604u)

/** \brief  6, Status Register */
#define MC54_MSTATUS /*lint --e(923)*/ (*(volatile Ifx_MC_MSTATUS*)0xF0064606u)

/** \brief  8, Range Register, single address mode */
#define MC54_RANGE /*lint --e(923)*/ (*(volatile Ifx_MC_RANGE*)0xF0064608u)

/** \brief  A0, Read Data and Bit Flip Register */
#define MC54_RDBFL0 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00646A0u)

/** \brief  A2, Read Data and Bit Flip Register */
#define MC54_RDBFL1 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00646A2u)

/** \brief  B4, Read Data and Bit Flip Register */
#define MC54_RDBFL10 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00646B4u)

/** \brief  B6, Read Data and Bit Flip Register */
#define MC54_RDBFL11 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00646B6u)

/** \brief  B8, Read Data and Bit Flip Register */
#define MC54_RDBFL12 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00646B8u)

/** \brief  BA, Read Data and Bit Flip Register */
#define MC54_RDBFL13 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00646BAu)

/** \brief  BC, Read Data and Bit Flip Register */
#define MC54_RDBFL14 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00646BCu)

/** \brief  BE, Read Data and Bit Flip Register */
#define MC54_RDBFL15 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00646BEu)

/** \brief  C0, Read Data and Bit Flip Register */
#define MC54_RDBFL16 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00646C0u)

/** \brief  C2, Read Data and Bit Flip Register */
#define MC54_RDBFL17 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00646C2u)

/** \brief  C4, Read Data and Bit Flip Register */
#define MC54_RDBFL18 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00646C4u)

/** \brief  C6, Read Data and Bit Flip Register */
#define MC54_RDBFL19 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00646C6u)

/** \brief  A4, Read Data and Bit Flip Register */
#define MC54_RDBFL2 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00646A4u)

/** \brief  C8, Read Data and Bit Flip Register */
#define MC54_RDBFL20 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00646C8u)

/** \brief  CA, Read Data and Bit Flip Register */
#define MC54_RDBFL21 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00646CAu)

/** \brief  CC, Read Data and Bit Flip Register */
#define MC54_RDBFL22 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00646CCu)

/** \brief  CE, Read Data and Bit Flip Register */
#define MC54_RDBFL23 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00646CEu)

/** \brief  D0, Read Data and Bit Flip Register */
#define MC54_RDBFL24 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00646D0u)

/** \brief  D2, Read Data and Bit Flip Register */
#define MC54_RDBFL25 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00646D2u)

/** \brief  D4, Read Data and Bit Flip Register */
#define MC54_RDBFL26 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00646D4u)

/** \brief  D6, Read Data and Bit Flip Register */
#define MC54_RDBFL27 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00646D6u)

/** \brief  D8, Read Data and Bit Flip Register */
#define MC54_RDBFL28 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00646D8u)

/** \brief  DA, Read Data and Bit Flip Register */
#define MC54_RDBFL29 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00646DAu)

/** \brief  A6, Read Data and Bit Flip Register */
#define MC54_RDBFL3 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00646A6u)

/** \brief  DC, Read Data and Bit Flip Register */
#define MC54_RDBFL30 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00646DCu)

/** \brief  DE, Read Data and Bit Flip Register */
#define MC54_RDBFL31 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00646DEu)

/** \brief  E0, Read Data and Bit Flip Register */
#define MC54_RDBFL32 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00646E0u)

/** \brief  E2, Read Data and Bit Flip Register */
#define MC54_RDBFL33 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00646E2u)

/** \brief  E4, Read Data and Bit Flip Register */
#define MC54_RDBFL34 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00646E4u)

/** \brief  E6, Read Data and Bit Flip Register */
#define MC54_RDBFL35 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00646E6u)

/** \brief  E8, Read Data and Bit Flip Register */
#define MC54_RDBFL36 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00646E8u)

/** \brief  EA, Read Data and Bit Flip Register */
#define MC54_RDBFL37 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00646EAu)

/** \brief  EC, Read Data and Bit Flip Register */
#define MC54_RDBFL38 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00646ECu)

/** \brief  EE, Read Data and Bit Flip Register */
#define MC54_RDBFL39 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00646EEu)

/** \brief  A8, Read Data and Bit Flip Register */
#define MC54_RDBFL4 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00646A8u)

/** \brief  AA, Read Data and Bit Flip Register */
#define MC54_RDBFL5 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00646AAu)

/** \brief  AC, Read Data and Bit Flip Register */
#define MC54_RDBFL6 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00646ACu)

/** \brief  AE, Read Data and Bit Flip Register */
#define MC54_RDBFL7 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00646AEu)

/** \brief  B0, Read Data and Bit Flip Register */
#define MC54_RDBFL8 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00646B0u)

/** \brief  B2, Read Data and Bit Flip Register */
#define MC54_RDBFL9 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00646B2u)

/** \brief  C, Revision ID Register */
#define MC54_REVID /*lint --e(923)*/ (*(volatile Ifx_MC_REVID*)0xF006460Cu)
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Mc_Cfg_Mc55
 * \{  */

/** \brief  0, Configuration Register 0 */
#define MC55_CONFIG0 /*lint --e(923)*/ (*(volatile Ifx_MC_CONFIG0*)0xF0064700u)

/** \brief  2, Configuration Register 1 */
#define MC55_CONFIG1 /*lint --e(923)*/ (*(volatile Ifx_MC_CONFIG1*)0xF0064702u)

/** \brief  10, Memory ECC Detection Register */
#define MC55_ECCD /*lint --e(923)*/ (*(volatile Ifx_MC_ECCD*)0xF0064710u)

/** \brief  E, ECC Safety Register */
#define MC55_ECCS /*lint --e(923)*/ (*(volatile Ifx_MC_ECCS*)0xF006470Eu)

/** \brief  12, Error Tracking Register */
#define MC55_ETRR0 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0064712u)

/** \brief  14, Error Tracking Register */
#define MC55_ETRR1 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0064714u)

/** \brief  16, Error Tracking Register */
#define MC55_ETRR2 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0064716u)

