luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxMc_reg.h
/** \brief  18, Error Tracking Register */
#define MC58_ETRR3 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0064A18u)

/** \brief  1A, Error Tracking Register */
#define MC58_ETRR4 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0064A1Au)

/** \brief  4, MBIST Control Register */
#define MC58_MCONTROL /*lint --e(923)*/ (*(volatile Ifx_MC_MCONTROL*)0xF0064A04u)

/** \brief  6, Status Register */
#define MC58_MSTATUS /*lint --e(923)*/ (*(volatile Ifx_MC_MSTATUS*)0xF0064A06u)

/** \brief  8, Range Register, single address mode */
#define MC58_RANGE /*lint --e(923)*/ (*(volatile Ifx_MC_RANGE*)0xF0064A08u)

/** \brief  A0, Read Data and Bit Flip Register */
#define MC58_RDBFL0 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064AA0u)

/** \brief  A2, Read Data and Bit Flip Register */
#define MC58_RDBFL1 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064AA2u)

/** \brief  B4, Read Data and Bit Flip Register */
#define MC58_RDBFL10 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064AB4u)

/** \brief  B6, Read Data and Bit Flip Register */
#define MC58_RDBFL11 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064AB6u)

/** \brief  B8, Read Data and Bit Flip Register */
#define MC58_RDBFL12 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064AB8u)

/** \brief  BA, Read Data and Bit Flip Register */
#define MC58_RDBFL13 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064ABAu)

/** \brief  BC, Read Data and Bit Flip Register */
#define MC58_RDBFL14 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064ABCu)

/** \brief  BE, Read Data and Bit Flip Register */
#define MC58_RDBFL15 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064ABEu)

/** \brief  C0, Read Data and Bit Flip Register */
#define MC58_RDBFL16 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064AC0u)

/** \brief  C2, Read Data and Bit Flip Register */
#define MC58_RDBFL17 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064AC2u)

/** \brief  C4, Read Data and Bit Flip Register */
#define MC58_RDBFL18 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064AC4u)

/** \brief  C6, Read Data and Bit Flip Register */
#define MC58_RDBFL19 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064AC6u)

/** \brief  A4, Read Data and Bit Flip Register */
#define MC58_RDBFL2 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064AA4u)

/** \brief  C8, Read Data and Bit Flip Register */
#define MC58_RDBFL20 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064AC8u)

/** \brief  CA, Read Data and Bit Flip Register */
#define MC58_RDBFL21 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064ACAu)

/** \brief  CC, Read Data and Bit Flip Register */
#define MC58_RDBFL22 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064ACCu)

/** \brief  CE, Read Data and Bit Flip Register */
#define MC58_RDBFL23 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064ACEu)

/** \brief  D0, Read Data and Bit Flip Register */
#define MC58_RDBFL24 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064AD0u)

/** \brief  D2, Read Data and Bit Flip Register */
#define MC58_RDBFL25 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064AD2u)

/** \brief  D4, Read Data and Bit Flip Register */
#define MC58_RDBFL26 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064AD4u)

/** \brief  D6, Read Data and Bit Flip Register */
#define MC58_RDBFL27 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064AD6u)

/** \brief  D8, Read Data and Bit Flip Register */
#define MC58_RDBFL28 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064AD8u)

/** \brief  DA, Read Data and Bit Flip Register */
#define MC58_RDBFL29 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064ADAu)

/** \brief  A6, Read Data and Bit Flip Register */
#define MC58_RDBFL3 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064AA6u)

/** \brief  DC, Read Data and Bit Flip Register */
#define MC58_RDBFL30 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064ADCu)

/** \brief  DE, Read Data and Bit Flip Register */
#define MC58_RDBFL31 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064ADEu)

/** \brief  E0, Read Data and Bit Flip Register */
#define MC58_RDBFL32 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064AE0u)

/** \brief  E2, Read Data and Bit Flip Register */
#define MC58_RDBFL33 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064AE2u)

/** \brief  E4, Read Data and Bit Flip Register */
#define MC58_RDBFL34 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064AE4u)

/** \brief  E6, Read Data and Bit Flip Register */
#define MC58_RDBFL35 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064AE6u)

/** \brief  E8, Read Data and Bit Flip Register */
#define MC58_RDBFL36 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064AE8u)

/** \brief  EA, Read Data and Bit Flip Register */
#define MC58_RDBFL37 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064AEAu)

/** \brief  EC, Read Data and Bit Flip Register */
#define MC58_RDBFL38 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064AECu)

/** \brief  EE, Read Data and Bit Flip Register */
#define MC58_RDBFL39 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064AEEu)

/** \brief  A8, Read Data and Bit Flip Register */
#define MC58_RDBFL4 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064AA8u)

/** \brief  AA, Read Data and Bit Flip Register */
#define MC58_RDBFL5 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064AAAu)

/** \brief  AC, Read Data and Bit Flip Register */
#define MC58_RDBFL6 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064AACu)

/** \brief  AE, Read Data and Bit Flip Register */
#define MC58_RDBFL7 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064AAEu)

/** \brief  B0, Read Data and Bit Flip Register */
#define MC58_RDBFL8 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064AB0u)

/** \brief  B2, Read Data and Bit Flip Register */
#define MC58_RDBFL9 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064AB2u)

/** \brief  C, Revision ID Register */
#define MC58_REVID /*lint --e(923)*/ (*(volatile Ifx_MC_REVID*)0xF0064A0Cu)
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Mc_Cfg_Mc59
 * \{  */

/** \brief  0, Configuration Register 0 */
#define MC59_CONFIG0 /*lint --e(923)*/ (*(volatile Ifx_MC_CONFIG0*)0xF0064B00u)

/** \brief  2, Configuration Register 1 */
#define MC59_CONFIG1 /*lint --e(923)*/ (*(volatile Ifx_MC_CONFIG1*)0xF0064B02u)

/** \brief  10, Memory ECC Detection Register */
#define MC59_ECCD /*lint --e(923)*/ (*(volatile Ifx_MC_ECCD*)0xF0064B10u)

/** \brief  E, ECC Safety Register */
#define MC59_ECCS /*lint --e(923)*/ (*(volatile Ifx_MC_ECCS*)0xF0064B0Eu)

/** \brief  12, Error Tracking Register */
#define MC59_ETRR0 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0064B12u)

/** \brief  14, Error Tracking Register */
#define MC59_ETRR1 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0064B14u)

/** \brief  16, Error Tracking Register */
#define MC59_ETRR2 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0064B16u)

