luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxMc_reg.h
/** \brief  18, Error Tracking Register */
#define MC63_ETRR3 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0064F18u)

/** \brief  1A, Error Tracking Register */
#define MC63_ETRR4 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0064F1Au)

/** \brief  4, MBIST Control Register */
#define MC63_MCONTROL /*lint --e(923)*/ (*(volatile Ifx_MC_MCONTROL*)0xF0064F04u)

/** \brief  6, Status Register */
#define MC63_MSTATUS /*lint --e(923)*/ (*(volatile Ifx_MC_MSTATUS*)0xF0064F06u)

/** \brief  8, Range Register, single address mode */
#define MC63_RANGE /*lint --e(923)*/ (*(volatile Ifx_MC_RANGE*)0xF0064F08u)

/** \brief  A0, Read Data and Bit Flip Register */
#define MC63_RDBFL0 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064FA0u)

/** \brief  A2, Read Data and Bit Flip Register */
#define MC63_RDBFL1 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064FA2u)

/** \brief  B4, Read Data and Bit Flip Register */
#define MC63_RDBFL10 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064FB4u)

/** \brief  B6, Read Data and Bit Flip Register */
#define MC63_RDBFL11 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064FB6u)

/** \brief  B8, Read Data and Bit Flip Register */
#define MC63_RDBFL12 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064FB8u)

/** \brief  BA, Read Data and Bit Flip Register */
#define MC63_RDBFL13 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064FBAu)

/** \brief  BC, Read Data and Bit Flip Register */
#define MC63_RDBFL14 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064FBCu)

/** \brief  BE, Read Data and Bit Flip Register */
#define MC63_RDBFL15 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064FBEu)

/** \brief  C0, Read Data and Bit Flip Register */
#define MC63_RDBFL16 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064FC0u)

/** \brief  C2, Read Data and Bit Flip Register */
#define MC63_RDBFL17 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064FC2u)

/** \brief  C4, Read Data and Bit Flip Register */
#define MC63_RDBFL18 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064FC4u)

/** \brief  C6, Read Data and Bit Flip Register */
#define MC63_RDBFL19 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064FC6u)

/** \brief  A4, Read Data and Bit Flip Register */
#define MC63_RDBFL2 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064FA4u)

/** \brief  C8, Read Data and Bit Flip Register */
#define MC63_RDBFL20 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064FC8u)

/** \brief  CA, Read Data and Bit Flip Register */
#define MC63_RDBFL21 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064FCAu)

/** \brief  CC, Read Data and Bit Flip Register */
#define MC63_RDBFL22 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064FCCu)

/** \brief  CE, Read Data and Bit Flip Register */
#define MC63_RDBFL23 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064FCEu)

/** \brief  D0, Read Data and Bit Flip Register */
#define MC63_RDBFL24 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064FD0u)

/** \brief  D2, Read Data and Bit Flip Register */
#define MC63_RDBFL25 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064FD2u)

/** \brief  D4, Read Data and Bit Flip Register */
#define MC63_RDBFL26 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064FD4u)

/** \brief  D6, Read Data and Bit Flip Register */
#define MC63_RDBFL27 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064FD6u)

/** \brief  D8, Read Data and Bit Flip Register */
#define MC63_RDBFL28 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064FD8u)

/** \brief  DA, Read Data and Bit Flip Register */
#define MC63_RDBFL29 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064FDAu)

/** \brief  A6, Read Data and Bit Flip Register */
#define MC63_RDBFL3 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064FA6u)

/** \brief  DC, Read Data and Bit Flip Register */
#define MC63_RDBFL30 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064FDCu)

/** \brief  DE, Read Data and Bit Flip Register */
#define MC63_RDBFL31 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064FDEu)

/** \brief  E0, Read Data and Bit Flip Register */
#define MC63_RDBFL32 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064FE0u)

/** \brief  E2, Read Data and Bit Flip Register */
#define MC63_RDBFL33 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064FE2u)

/** \brief  E4, Read Data and Bit Flip Register */
#define MC63_RDBFL34 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064FE4u)

/** \brief  E6, Read Data and Bit Flip Register */
#define MC63_RDBFL35 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064FE6u)

/** \brief  E8, Read Data and Bit Flip Register */
#define MC63_RDBFL36 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064FE8u)

/** \brief  EA, Read Data and Bit Flip Register */
#define MC63_RDBFL37 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064FEAu)

/** \brief  EC, Read Data and Bit Flip Register */
#define MC63_RDBFL38 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064FECu)

/** \brief  EE, Read Data and Bit Flip Register */
#define MC63_RDBFL39 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064FEEu)

/** \brief  A8, Read Data and Bit Flip Register */
#define MC63_RDBFL4 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064FA8u)

/** \brief  AA, Read Data and Bit Flip Register */
#define MC63_RDBFL5 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064FAAu)

/** \brief  AC, Read Data and Bit Flip Register */
#define MC63_RDBFL6 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064FACu)

/** \brief  AE, Read Data and Bit Flip Register */
#define MC63_RDBFL7 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064FAEu)

/** \brief  B0, Read Data and Bit Flip Register */
#define MC63_RDBFL8 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064FB0u)

/** \brief  B2, Read Data and Bit Flip Register */
#define MC63_RDBFL9 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064FB2u)

/** \brief  C, Revision ID Register */
#define MC63_REVID /*lint --e(923)*/ (*(volatile Ifx_MC_REVID*)0xF0064F0Cu)
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Mc_Cfg_Mc64
 * \{  */

/** \brief  0, Configuration Register 0 */
#define MC64_CONFIG0 /*lint --e(923)*/ (*(volatile Ifx_MC_CONFIG0*)0xF0065000u)

/** \brief  2, Configuration Register 1 */
#define MC64_CONFIG1 /*lint --e(923)*/ (*(volatile Ifx_MC_CONFIG1*)0xF0065002u)

/** \brief  10, Memory ECC Detection Register */
#define MC64_ECCD /*lint --e(923)*/ (*(volatile Ifx_MC_ECCD*)0xF0065010u)

/** \brief  E, ECC Safety Register */
#define MC64_ECCS /*lint --e(923)*/ (*(volatile Ifx_MC_ECCS*)0xF006500Eu)

/** \brief  12, Error Tracking Register */
#define MC64_ETRR0 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0065012u)

/** \brief  14, Error Tracking Register */
#define MC64_ETRR1 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0065014u)

/** \brief  16, Error Tracking Register */
#define MC64_ETRR2 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0065016u)

