luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxMc_reg.h
/** \brief  18, Error Tracking Register */
#define MC64_ETRR3 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0065018u)

/** \brief  1A, Error Tracking Register */
#define MC64_ETRR4 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF006501Au)

/** \brief  4, MBIST Control Register */
#define MC64_MCONTROL /*lint --e(923)*/ (*(volatile Ifx_MC_MCONTROL*)0xF0065004u)

/** \brief  6, Status Register */
#define MC64_MSTATUS /*lint --e(923)*/ (*(volatile Ifx_MC_MSTATUS*)0xF0065006u)

/** \brief  8, Range Register, single address mode */
#define MC64_RANGE /*lint --e(923)*/ (*(volatile Ifx_MC_RANGE*)0xF0065008u)

/** \brief  A0, Read Data and Bit Flip Register */
#define MC64_RDBFL0 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00650A0u)

/** \brief  A2, Read Data and Bit Flip Register */
#define MC64_RDBFL1 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00650A2u)

/** \brief  B4, Read Data and Bit Flip Register */
#define MC64_RDBFL10 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00650B4u)

/** \brief  B6, Read Data and Bit Flip Register */
#define MC64_RDBFL11 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00650B6u)

/** \brief  B8, Read Data and Bit Flip Register */
#define MC64_RDBFL12 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00650B8u)

/** \brief  BA, Read Data and Bit Flip Register */
#define MC64_RDBFL13 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00650BAu)

/** \brief  BC, Read Data and Bit Flip Register */
#define MC64_RDBFL14 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00650BCu)

/** \brief  BE, Read Data and Bit Flip Register */
#define MC64_RDBFL15 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00650BEu)

/** \brief  C0, Read Data and Bit Flip Register */
#define MC64_RDBFL16 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00650C0u)

/** \brief  C2, Read Data and Bit Flip Register */
#define MC64_RDBFL17 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00650C2u)

/** \brief  C4, Read Data and Bit Flip Register */
#define MC64_RDBFL18 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00650C4u)

/** \brief  C6, Read Data and Bit Flip Register */
#define MC64_RDBFL19 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00650C6u)

/** \brief  A4, Read Data and Bit Flip Register */
#define MC64_RDBFL2 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00650A4u)

/** \brief  C8, Read Data and Bit Flip Register */
#define MC64_RDBFL20 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00650C8u)

/** \brief  CA, Read Data and Bit Flip Register */
#define MC64_RDBFL21 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00650CAu)

/** \brief  CC, Read Data and Bit Flip Register */
#define MC64_RDBFL22 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00650CCu)

/** \brief  CE, Read Data and Bit Flip Register */
#define MC64_RDBFL23 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00650CEu)

/** \brief  D0, Read Data and Bit Flip Register */
#define MC64_RDBFL24 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00650D0u)

/** \brief  D2, Read Data and Bit Flip Register */
#define MC64_RDBFL25 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00650D2u)

/** \brief  D4, Read Data and Bit Flip Register */
#define MC64_RDBFL26 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00650D4u)

/** \brief  D6, Read Data and Bit Flip Register */
#define MC64_RDBFL27 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00650D6u)

/** \brief  D8, Read Data and Bit Flip Register */
#define MC64_RDBFL28 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00650D8u)

/** \brief  DA, Read Data and Bit Flip Register */
#define MC64_RDBFL29 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00650DAu)

/** \brief  A6, Read Data and Bit Flip Register */
#define MC64_RDBFL3 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00650A6u)

/** \brief  DC, Read Data and Bit Flip Register */
#define MC64_RDBFL30 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00650DCu)

/** \brief  DE, Read Data and Bit Flip Register */
#define MC64_RDBFL31 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00650DEu)

/** \brief  E0, Read Data and Bit Flip Register */
#define MC64_RDBFL32 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00650E0u)

/** \brief  E2, Read Data and Bit Flip Register */
#define MC64_RDBFL33 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00650E2u)

/** \brief  E4, Read Data and Bit Flip Register */
#define MC64_RDBFL34 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00650E4u)

/** \brief  E6, Read Data and Bit Flip Register */
#define MC64_RDBFL35 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00650E6u)

/** \brief  E8, Read Data and Bit Flip Register */
#define MC64_RDBFL36 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00650E8u)

/** \brief  EA, Read Data and Bit Flip Register */
#define MC64_RDBFL37 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00650EAu)

/** \brief  EC, Read Data and Bit Flip Register */
#define MC64_RDBFL38 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00650ECu)

/** \brief  EE, Read Data and Bit Flip Register */
#define MC64_RDBFL39 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00650EEu)

/** \brief  A8, Read Data and Bit Flip Register */
#define MC64_RDBFL4 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00650A8u)

/** \brief  AA, Read Data and Bit Flip Register */
#define MC64_RDBFL5 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00650AAu)

/** \brief  AC, Read Data and Bit Flip Register */
#define MC64_RDBFL6 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00650ACu)

/** \brief  AE, Read Data and Bit Flip Register */
#define MC64_RDBFL7 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00650AEu)

/** \brief  B0, Read Data and Bit Flip Register */
#define MC64_RDBFL8 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00650B0u)

/** \brief  B2, Read Data and Bit Flip Register */
#define MC64_RDBFL9 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00650B2u)

/** \brief  C, Revision ID Register */
#define MC64_REVID /*lint --e(923)*/ (*(volatile Ifx_MC_REVID*)0xF006500Cu)
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Mc_Cfg_Mc65
 * \{  */

/** \brief  0, Configuration Register 0 */
#define MC65_CONFIG0 /*lint --e(923)*/ (*(volatile Ifx_MC_CONFIG0*)0xF0065100u)

/** \brief  2, Configuration Register 1 */
#define MC65_CONFIG1 /*lint --e(923)*/ (*(volatile Ifx_MC_CONFIG1*)0xF0065102u)

/** \brief  10, Memory ECC Detection Register */
#define MC65_ECCD /*lint --e(923)*/ (*(volatile Ifx_MC_ECCD*)0xF0065110u)

/** \brief  E, ECC Safety Register */
#define MC65_ECCS /*lint --e(923)*/ (*(volatile Ifx_MC_ECCS*)0xF006510Eu)

/** \brief  12, Error Tracking Register */
#define MC65_ETRR0 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0065112u)

/** \brief  14, Error Tracking Register */
#define MC65_ETRR1 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0065114u)

/** \brief  16, Error Tracking Register */
#define MC65_ETRR2 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0065116u)

