luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxMc_reg.h
/** \brief  18, Error Tracking Register */
#define MC65_ETRR3 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0065118u)

/** \brief  1A, Error Tracking Register */
#define MC65_ETRR4 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF006511Au)

/** \brief  4, MBIST Control Register */
#define MC65_MCONTROL /*lint --e(923)*/ (*(volatile Ifx_MC_MCONTROL*)0xF0065104u)

/** \brief  6, Status Register */
#define MC65_MSTATUS /*lint --e(923)*/ (*(volatile Ifx_MC_MSTATUS*)0xF0065106u)

/** \brief  8, Range Register, single address mode */
#define MC65_RANGE /*lint --e(923)*/ (*(volatile Ifx_MC_RANGE*)0xF0065108u)

/** \brief  A0, Read Data and Bit Flip Register */
#define MC65_RDBFL0 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00651A0u)

/** \brief  A2, Read Data and Bit Flip Register */
#define MC65_RDBFL1 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00651A2u)

/** \brief  B4, Read Data and Bit Flip Register */
#define MC65_RDBFL10 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00651B4u)

/** \brief  B6, Read Data and Bit Flip Register */
#define MC65_RDBFL11 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00651B6u)

/** \brief  B8, Read Data and Bit Flip Register */
#define MC65_RDBFL12 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00651B8u)

/** \brief  BA, Read Data and Bit Flip Register */
#define MC65_RDBFL13 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00651BAu)

/** \brief  BC, Read Data and Bit Flip Register */
#define MC65_RDBFL14 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00651BCu)

/** \brief  BE, Read Data and Bit Flip Register */
#define MC65_RDBFL15 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00651BEu)

/** \brief  C0, Read Data and Bit Flip Register */
#define MC65_RDBFL16 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00651C0u)

/** \brief  C2, Read Data and Bit Flip Register */
#define MC65_RDBFL17 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00651C2u)

/** \brief  C4, Read Data and Bit Flip Register */
#define MC65_RDBFL18 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00651C4u)

/** \brief  C6, Read Data and Bit Flip Register */
#define MC65_RDBFL19 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00651C6u)

/** \brief  A4, Read Data and Bit Flip Register */
#define MC65_RDBFL2 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00651A4u)

/** \brief  C8, Read Data and Bit Flip Register */
#define MC65_RDBFL20 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00651C8u)

/** \brief  CA, Read Data and Bit Flip Register */
#define MC65_RDBFL21 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00651CAu)

/** \brief  CC, Read Data and Bit Flip Register */
#define MC65_RDBFL22 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00651CCu)

/** \brief  CE, Read Data and Bit Flip Register */
#define MC65_RDBFL23 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00651CEu)

/** \brief  D0, Read Data and Bit Flip Register */
#define MC65_RDBFL24 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00651D0u)

/** \brief  D2, Read Data and Bit Flip Register */
#define MC65_RDBFL25 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00651D2u)

/** \brief  D4, Read Data and Bit Flip Register */
#define MC65_RDBFL26 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00651D4u)

/** \brief  D6, Read Data and Bit Flip Register */
#define MC65_RDBFL27 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00651D6u)

/** \brief  D8, Read Data and Bit Flip Register */
#define MC65_RDBFL28 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00651D8u)

/** \brief  DA, Read Data and Bit Flip Register */
#define MC65_RDBFL29 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00651DAu)

/** \brief  A6, Read Data and Bit Flip Register */
#define MC65_RDBFL3 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00651A6u)

/** \brief  DC, Read Data and Bit Flip Register */
#define MC65_RDBFL30 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00651DCu)

/** \brief  DE, Read Data and Bit Flip Register */
#define MC65_RDBFL31 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00651DEu)

/** \brief  E0, Read Data and Bit Flip Register */
#define MC65_RDBFL32 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00651E0u)

/** \brief  E2, Read Data and Bit Flip Register */
#define MC65_RDBFL33 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00651E2u)

/** \brief  E4, Read Data and Bit Flip Register */
#define MC65_RDBFL34 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00651E4u)

/** \brief  E6, Read Data and Bit Flip Register */
#define MC65_RDBFL35 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00651E6u)

/** \brief  E8, Read Data and Bit Flip Register */
#define MC65_RDBFL36 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00651E8u)

/** \brief  EA, Read Data and Bit Flip Register */
#define MC65_RDBFL37 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00651EAu)

/** \brief  EC, Read Data and Bit Flip Register */
#define MC65_RDBFL38 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00651ECu)

/** \brief  EE, Read Data and Bit Flip Register */
#define MC65_RDBFL39 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00651EEu)

/** \brief  A8, Read Data and Bit Flip Register */
#define MC65_RDBFL4 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00651A8u)

/** \brief  AA, Read Data and Bit Flip Register */
#define MC65_RDBFL5 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00651AAu)

/** \brief  AC, Read Data and Bit Flip Register */
#define MC65_RDBFL6 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00651ACu)

/** \brief  AE, Read Data and Bit Flip Register */
#define MC65_RDBFL7 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00651AEu)

/** \brief  B0, Read Data and Bit Flip Register */
#define MC65_RDBFL8 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00651B0u)

/** \brief  B2, Read Data and Bit Flip Register */
#define MC65_RDBFL9 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00651B2u)

/** \brief  C, Revision ID Register */
#define MC65_REVID /*lint --e(923)*/ (*(volatile Ifx_MC_REVID*)0xF006510Cu)
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Mc_Cfg_Mc66
 * \{  */

/** \brief  0, Configuration Register 0 */
#define MC66_CONFIG0 /*lint --e(923)*/ (*(volatile Ifx_MC_CONFIG0*)0xF0065200u)

/** \brief  2, Configuration Register 1 */
#define MC66_CONFIG1 /*lint --e(923)*/ (*(volatile Ifx_MC_CONFIG1*)0xF0065202u)

/** \brief  10, Memory ECC Detection Register */
#define MC66_ECCD /*lint --e(923)*/ (*(volatile Ifx_MC_ECCD*)0xF0065210u)

/** \brief  E, ECC Safety Register */
#define MC66_ECCS /*lint --e(923)*/ (*(volatile Ifx_MC_ECCS*)0xF006520Eu)

/** \brief  12, Error Tracking Register */
#define MC66_ETRR0 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0065212u)

/** \brief  14, Error Tracking Register */
#define MC66_ETRR1 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0065214u)

/** \brief  16, Error Tracking Register */
#define MC66_ETRR2 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0065216u)

