luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxMc_reg.h
/** \brief  18, Error Tracking Register */
#define MC67_ETRR3 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0065318u)

/** \brief  1A, Error Tracking Register */
#define MC67_ETRR4 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF006531Au)

/** \brief  4, MBIST Control Register */
#define MC67_MCONTROL /*lint --e(923)*/ (*(volatile Ifx_MC_MCONTROL*)0xF0065304u)

/** \brief  6, Status Register */
#define MC67_MSTATUS /*lint --e(923)*/ (*(volatile Ifx_MC_MSTATUS*)0xF0065306u)

/** \brief  8, Range Register, single address mode */
#define MC67_RANGE /*lint --e(923)*/ (*(volatile Ifx_MC_RANGE*)0xF0065308u)

/** \brief  A0, Read Data and Bit Flip Register */
#define MC67_RDBFL0 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00653A0u)

/** \brief  A2, Read Data and Bit Flip Register */
#define MC67_RDBFL1 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00653A2u)

/** \brief  B4, Read Data and Bit Flip Register */
#define MC67_RDBFL10 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00653B4u)

/** \brief  B6, Read Data and Bit Flip Register */
#define MC67_RDBFL11 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00653B6u)

/** \brief  B8, Read Data and Bit Flip Register */
#define MC67_RDBFL12 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00653B8u)

/** \brief  BA, Read Data and Bit Flip Register */
#define MC67_RDBFL13 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00653BAu)

/** \brief  BC, Read Data and Bit Flip Register */
#define MC67_RDBFL14 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00653BCu)

/** \brief  BE, Read Data and Bit Flip Register */
#define MC67_RDBFL15 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00653BEu)

/** \brief  C0, Read Data and Bit Flip Register */
#define MC67_RDBFL16 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00653C0u)

/** \brief  C2, Read Data and Bit Flip Register */
#define MC67_RDBFL17 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00653C2u)

/** \brief  C4, Read Data and Bit Flip Register */
#define MC67_RDBFL18 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00653C4u)

/** \brief  C6, Read Data and Bit Flip Register */
#define MC67_RDBFL19 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00653C6u)

/** \brief  A4, Read Data and Bit Flip Register */
#define MC67_RDBFL2 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00653A4u)

/** \brief  C8, Read Data and Bit Flip Register */
#define MC67_RDBFL20 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00653C8u)

/** \brief  CA, Read Data and Bit Flip Register */
#define MC67_RDBFL21 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00653CAu)

/** \brief  CC, Read Data and Bit Flip Register */
#define MC67_RDBFL22 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00653CCu)

/** \brief  CE, Read Data and Bit Flip Register */
#define MC67_RDBFL23 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00653CEu)

/** \brief  D0, Read Data and Bit Flip Register */
#define MC67_RDBFL24 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00653D0u)

/** \brief  D2, Read Data and Bit Flip Register */
#define MC67_RDBFL25 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00653D2u)

/** \brief  D4, Read Data and Bit Flip Register */
#define MC67_RDBFL26 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00653D4u)

/** \brief  D6, Read Data and Bit Flip Register */
#define MC67_RDBFL27 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00653D6u)

/** \brief  D8, Read Data and Bit Flip Register */
#define MC67_RDBFL28 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00653D8u)

/** \brief  DA, Read Data and Bit Flip Register */
#define MC67_RDBFL29 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00653DAu)

/** \brief  A6, Read Data and Bit Flip Register */
#define MC67_RDBFL3 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00653A6u)

/** \brief  DC, Read Data and Bit Flip Register */
#define MC67_RDBFL30 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00653DCu)

/** \brief  DE, Read Data and Bit Flip Register */
#define MC67_RDBFL31 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00653DEu)

/** \brief  E0, Read Data and Bit Flip Register */
#define MC67_RDBFL32 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00653E0u)

/** \brief  E2, Read Data and Bit Flip Register */
#define MC67_RDBFL33 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00653E2u)

/** \brief  E4, Read Data and Bit Flip Register */
#define MC67_RDBFL34 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00653E4u)

/** \brief  E6, Read Data and Bit Flip Register */
#define MC67_RDBFL35 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00653E6u)

/** \brief  E8, Read Data and Bit Flip Register */
#define MC67_RDBFL36 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00653E8u)

/** \brief  EA, Read Data and Bit Flip Register */
#define MC67_RDBFL37 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00653EAu)

/** \brief  EC, Read Data and Bit Flip Register */
#define MC67_RDBFL38 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00653ECu)

/** \brief  EE, Read Data and Bit Flip Register */
#define MC67_RDBFL39 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00653EEu)

/** \brief  A8, Read Data and Bit Flip Register */
#define MC67_RDBFL4 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00653A8u)

/** \brief  AA, Read Data and Bit Flip Register */
#define MC67_RDBFL5 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00653AAu)

/** \brief  AC, Read Data and Bit Flip Register */
#define MC67_RDBFL6 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00653ACu)

/** \brief  AE, Read Data and Bit Flip Register */
#define MC67_RDBFL7 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00653AEu)

/** \brief  B0, Read Data and Bit Flip Register */
#define MC67_RDBFL8 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00653B0u)

/** \brief  B2, Read Data and Bit Flip Register */
#define MC67_RDBFL9 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00653B2u)

/** \brief  C, Revision ID Register */
#define MC67_REVID /*lint --e(923)*/ (*(volatile Ifx_MC_REVID*)0xF006530Cu)
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Mc_Cfg_Mc68
 * \{  */

/** \brief  0, Configuration Register 0 */
#define MC68_CONFIG0 /*lint --e(923)*/ (*(volatile Ifx_MC_CONFIG0*)0xF0065400u)

/** \brief  2, Configuration Register 1 */
#define MC68_CONFIG1 /*lint --e(923)*/ (*(volatile Ifx_MC_CONFIG1*)0xF0065402u)

/** \brief  10, Memory ECC Detection Register */
#define MC68_ECCD /*lint --e(923)*/ (*(volatile Ifx_MC_ECCD*)0xF0065410u)

/** \brief  E, ECC Safety Register */
#define MC68_ECCS /*lint --e(923)*/ (*(volatile Ifx_MC_ECCS*)0xF006540Eu)

/** \brief  12, Error Tracking Register */
#define MC68_ETRR0 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0065412u)

/** \brief  14, Error Tracking Register */
#define MC68_ETRR1 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0065414u)

/** \brief  16, Error Tracking Register */
#define MC68_ETRR2 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0065416u)

