luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxMc_reg.h
/** \brief  18, Error Tracking Register */
#define MC71_ETRR3 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0065718u)

/** \brief  1A, Error Tracking Register */
#define MC71_ETRR4 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF006571Au)

/** \brief  4, MBIST Control Register */
#define MC71_MCONTROL /*lint --e(923)*/ (*(volatile Ifx_MC_MCONTROL*)0xF0065704u)

/** \brief  6, Status Register */
#define MC71_MSTATUS /*lint --e(923)*/ (*(volatile Ifx_MC_MSTATUS*)0xF0065706u)

/** \brief  8, Range Register, single address mode */
#define MC71_RANGE /*lint --e(923)*/ (*(volatile Ifx_MC_RANGE*)0xF0065708u)

/** \brief  A0, Read Data and Bit Flip Register */
#define MC71_RDBFL0 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00657A0u)

/** \brief  A2, Read Data and Bit Flip Register */
#define MC71_RDBFL1 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00657A2u)

/** \brief  B4, Read Data and Bit Flip Register */
#define MC71_RDBFL10 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00657B4u)

/** \brief  B6, Read Data and Bit Flip Register */
#define MC71_RDBFL11 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00657B6u)

/** \brief  B8, Read Data and Bit Flip Register */
#define MC71_RDBFL12 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00657B8u)

/** \brief  BA, Read Data and Bit Flip Register */
#define MC71_RDBFL13 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00657BAu)

/** \brief  BC, Read Data and Bit Flip Register */
#define MC71_RDBFL14 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00657BCu)

/** \brief  BE, Read Data and Bit Flip Register */
#define MC71_RDBFL15 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00657BEu)

/** \brief  C0, Read Data and Bit Flip Register */
#define MC71_RDBFL16 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00657C0u)

/** \brief  C2, Read Data and Bit Flip Register */
#define MC71_RDBFL17 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00657C2u)

/** \brief  C4, Read Data and Bit Flip Register */
#define MC71_RDBFL18 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00657C4u)

/** \brief  C6, Read Data and Bit Flip Register */
#define MC71_RDBFL19 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00657C6u)

/** \brief  A4, Read Data and Bit Flip Register */
#define MC71_RDBFL2 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00657A4u)

/** \brief  C8, Read Data and Bit Flip Register */
#define MC71_RDBFL20 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00657C8u)

/** \brief  CA, Read Data and Bit Flip Register */
#define MC71_RDBFL21 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00657CAu)

/** \brief  CC, Read Data and Bit Flip Register */
#define MC71_RDBFL22 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00657CCu)

/** \brief  CE, Read Data and Bit Flip Register */
#define MC71_RDBFL23 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00657CEu)

/** \brief  D0, Read Data and Bit Flip Register */
#define MC71_RDBFL24 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00657D0u)

/** \brief  D2, Read Data and Bit Flip Register */
#define MC71_RDBFL25 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00657D2u)

/** \brief  D4, Read Data and Bit Flip Register */
#define MC71_RDBFL26 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00657D4u)

/** \brief  D6, Read Data and Bit Flip Register */
#define MC71_RDBFL27 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00657D6u)

/** \brief  D8, Read Data and Bit Flip Register */
#define MC71_RDBFL28 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00657D8u)

/** \brief  DA, Read Data and Bit Flip Register */
#define MC71_RDBFL29 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00657DAu)

/** \brief  A6, Read Data and Bit Flip Register */
#define MC71_RDBFL3 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00657A6u)

/** \brief  DC, Read Data and Bit Flip Register */
#define MC71_RDBFL30 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00657DCu)

/** \brief  DE, Read Data and Bit Flip Register */
#define MC71_RDBFL31 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00657DEu)

/** \brief  E0, Read Data and Bit Flip Register */
#define MC71_RDBFL32 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00657E0u)

/** \brief  E2, Read Data and Bit Flip Register */
#define MC71_RDBFL33 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00657E2u)

/** \brief  E4, Read Data and Bit Flip Register */
#define MC71_RDBFL34 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00657E4u)

/** \brief  E6, Read Data and Bit Flip Register */
#define MC71_RDBFL35 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00657E6u)

/** \brief  E8, Read Data and Bit Flip Register */
#define MC71_RDBFL36 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00657E8u)

/** \brief  EA, Read Data and Bit Flip Register */
#define MC71_RDBFL37 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00657EAu)

/** \brief  EC, Read Data and Bit Flip Register */
#define MC71_RDBFL38 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00657ECu)

/** \brief  EE, Read Data and Bit Flip Register */
#define MC71_RDBFL39 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00657EEu)

/** \brief  A8, Read Data and Bit Flip Register */
#define MC71_RDBFL4 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00657A8u)

/** \brief  AA, Read Data and Bit Flip Register */
#define MC71_RDBFL5 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00657AAu)

/** \brief  AC, Read Data and Bit Flip Register */
#define MC71_RDBFL6 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00657ACu)

/** \brief  AE, Read Data and Bit Flip Register */
#define MC71_RDBFL7 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00657AEu)

/** \brief  B0, Read Data and Bit Flip Register */
#define MC71_RDBFL8 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00657B0u)

/** \brief  B2, Read Data and Bit Flip Register */
#define MC71_RDBFL9 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00657B2u)

/** \brief  C, Revision ID Register */
#define MC71_REVID /*lint --e(923)*/ (*(volatile Ifx_MC_REVID*)0xF006570Cu)
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Mc_Cfg_Mc72
 * \{  */

/** \brief  0, Configuration Register 0 */
#define MC72_CONFIG0 /*lint --e(923)*/ (*(volatile Ifx_MC_CONFIG0*)0xF0065800u)

/** \brief  2, Configuration Register 1 */
#define MC72_CONFIG1 /*lint --e(923)*/ (*(volatile Ifx_MC_CONFIG1*)0xF0065802u)

/** \brief  10, Memory ECC Detection Register */
#define MC72_ECCD /*lint --e(923)*/ (*(volatile Ifx_MC_ECCD*)0xF0065810u)

/** \brief  E, ECC Safety Register */
#define MC72_ECCS /*lint --e(923)*/ (*(volatile Ifx_MC_ECCS*)0xF006580Eu)

/** \brief  12, Error Tracking Register */
#define MC72_ETRR0 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0065812u)

/** \brief  14, Error Tracking Register */
#define MC72_ETRR1 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0065814u)

/** \brief  16, Error Tracking Register */
#define MC72_ETRR2 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0065816u)

