luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxMc_reg.h
/** \brief  18, Error Tracking Register */
#define MC79_ETRR3 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0065F18u)

/** \brief  1A, Error Tracking Register */
#define MC79_ETRR4 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0065F1Au)

/** \brief  4, MBIST Control Register */
#define MC79_MCONTROL /*lint --e(923)*/ (*(volatile Ifx_MC_MCONTROL*)0xF0065F04u)

/** \brief  6, Status Register */
#define MC79_MSTATUS /*lint --e(923)*/ (*(volatile Ifx_MC_MSTATUS*)0xF0065F06u)

/** \brief  8, Range Register, single address mode */
#define MC79_RANGE /*lint --e(923)*/ (*(volatile Ifx_MC_RANGE*)0xF0065F08u)

/** \brief  A0, Read Data and Bit Flip Register */
#define MC79_RDBFL0 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065FA0u)

/** \brief  A2, Read Data and Bit Flip Register */
#define MC79_RDBFL1 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065FA2u)

/** \brief  B4, Read Data and Bit Flip Register */
#define MC79_RDBFL10 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065FB4u)

/** \brief  B6, Read Data and Bit Flip Register */
#define MC79_RDBFL11 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065FB6u)

/** \brief  B8, Read Data and Bit Flip Register */
#define MC79_RDBFL12 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065FB8u)

/** \brief  BA, Read Data and Bit Flip Register */
#define MC79_RDBFL13 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065FBAu)

/** \brief  BC, Read Data and Bit Flip Register */
#define MC79_RDBFL14 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065FBCu)

/** \brief  BE, Read Data and Bit Flip Register */
#define MC79_RDBFL15 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065FBEu)

/** \brief  C0, Read Data and Bit Flip Register */
#define MC79_RDBFL16 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065FC0u)

/** \brief  C2, Read Data and Bit Flip Register */
#define MC79_RDBFL17 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065FC2u)

/** \brief  C4, Read Data and Bit Flip Register */
#define MC79_RDBFL18 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065FC4u)

/** \brief  C6, Read Data and Bit Flip Register */
#define MC79_RDBFL19 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065FC6u)

/** \brief  A4, Read Data and Bit Flip Register */
#define MC79_RDBFL2 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065FA4u)

/** \brief  C8, Read Data and Bit Flip Register */
#define MC79_RDBFL20 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065FC8u)

/** \brief  CA, Read Data and Bit Flip Register */
#define MC79_RDBFL21 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065FCAu)

/** \brief  CC, Read Data and Bit Flip Register */
#define MC79_RDBFL22 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065FCCu)

/** \brief  CE, Read Data and Bit Flip Register */
#define MC79_RDBFL23 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065FCEu)

/** \brief  D0, Read Data and Bit Flip Register */
#define MC79_RDBFL24 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065FD0u)

/** \brief  D2, Read Data and Bit Flip Register */
#define MC79_RDBFL25 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065FD2u)

/** \brief  D4, Read Data and Bit Flip Register */
#define MC79_RDBFL26 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065FD4u)

/** \brief  D6, Read Data and Bit Flip Register */
#define MC79_RDBFL27 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065FD6u)

/** \brief  D8, Read Data and Bit Flip Register */
#define MC79_RDBFL28 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065FD8u)

/** \brief  DA, Read Data and Bit Flip Register */
#define MC79_RDBFL29 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065FDAu)

/** \brief  A6, Read Data and Bit Flip Register */
#define MC79_RDBFL3 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065FA6u)

/** \brief  DC, Read Data and Bit Flip Register */
#define MC79_RDBFL30 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065FDCu)

/** \brief  DE, Read Data and Bit Flip Register */
#define MC79_RDBFL31 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065FDEu)

/** \brief  E0, Read Data and Bit Flip Register */
#define MC79_RDBFL32 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065FE0u)

/** \brief  E2, Read Data and Bit Flip Register */
#define MC79_RDBFL33 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065FE2u)

/** \brief  E4, Read Data and Bit Flip Register */
#define MC79_RDBFL34 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065FE4u)

/** \brief  E6, Read Data and Bit Flip Register */
#define MC79_RDBFL35 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065FE6u)

/** \brief  E8, Read Data and Bit Flip Register */
#define MC79_RDBFL36 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065FE8u)

/** \brief  EA, Read Data and Bit Flip Register */
#define MC79_RDBFL37 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065FEAu)

/** \brief  EC, Read Data and Bit Flip Register */
#define MC79_RDBFL38 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065FECu)

/** \brief  EE, Read Data and Bit Flip Register */
#define MC79_RDBFL39 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065FEEu)

/** \brief  A8, Read Data and Bit Flip Register */
#define MC79_RDBFL4 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065FA8u)

/** \brief  AA, Read Data and Bit Flip Register */
#define MC79_RDBFL5 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065FAAu)

/** \brief  AC, Read Data and Bit Flip Register */
#define MC79_RDBFL6 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065FACu)

/** \brief  AE, Read Data and Bit Flip Register */
#define MC79_RDBFL7 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065FAEu)

/** \brief  B0, Read Data and Bit Flip Register */
#define MC79_RDBFL8 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065FB0u)

/** \brief  B2, Read Data and Bit Flip Register */
#define MC79_RDBFL9 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065FB2u)

/** \brief  C, Revision ID Register */
#define MC79_REVID /*lint --e(923)*/ (*(volatile Ifx_MC_REVID*)0xF0065F0Cu)
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Mc_Cfg_Mc80
 * \{  */

/** \brief  0, Configuration Register 0 */
#define MC80_CONFIG0 /*lint --e(923)*/ (*(volatile Ifx_MC_CONFIG0*)0xF0066000u)

/** \brief  2, Configuration Register 1 */
#define MC80_CONFIG1 /*lint --e(923)*/ (*(volatile Ifx_MC_CONFIG1*)0xF0066002u)

/** \brief  10, Memory ECC Detection Register */
#define MC80_ECCD /*lint --e(923)*/ (*(volatile Ifx_MC_ECCD*)0xF0066010u)

/** \brief  E, ECC Safety Register */
#define MC80_ECCS /*lint --e(923)*/ (*(volatile Ifx_MC_ECCS*)0xF006600Eu)

/** \brief  12, Error Tracking Register */
#define MC80_ETRR0 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0066012u)

/** \brief  14, Error Tracking Register */
#define MC80_ETRR1 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0066014u)

/** \brief  16, Error Tracking Register */
#define MC80_ETRR2 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0066016u)

