luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxMc_reg.h
/** \brief  18, Error Tracking Register */
#define MC81_ETRR3 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0066118u)

/** \brief  1A, Error Tracking Register */
#define MC81_ETRR4 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF006611Au)

/** \brief  4, MBIST Control Register */
#define MC81_MCONTROL /*lint --e(923)*/ (*(volatile Ifx_MC_MCONTROL*)0xF0066104u)

/** \brief  6, Status Register */
#define MC81_MSTATUS /*lint --e(923)*/ (*(volatile Ifx_MC_MSTATUS*)0xF0066106u)

/** \brief  8, Range Register, single address mode */
#define MC81_RANGE /*lint --e(923)*/ (*(volatile Ifx_MC_RANGE*)0xF0066108u)

/** \brief  A0, Read Data and Bit Flip Register */
#define MC81_RDBFL0 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00661A0u)

/** \brief  A2, Read Data and Bit Flip Register */
#define MC81_RDBFL1 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00661A2u)

/** \brief  B4, Read Data and Bit Flip Register */
#define MC81_RDBFL10 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00661B4u)

/** \brief  B6, Read Data and Bit Flip Register */
#define MC81_RDBFL11 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00661B6u)

/** \brief  B8, Read Data and Bit Flip Register */
#define MC81_RDBFL12 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00661B8u)

/** \brief  BA, Read Data and Bit Flip Register */
#define MC81_RDBFL13 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00661BAu)

/** \brief  BC, Read Data and Bit Flip Register */
#define MC81_RDBFL14 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00661BCu)

/** \brief  BE, Read Data and Bit Flip Register */
#define MC81_RDBFL15 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00661BEu)

/** \brief  C0, Read Data and Bit Flip Register */
#define MC81_RDBFL16 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00661C0u)

/** \brief  C2, Read Data and Bit Flip Register */
#define MC81_RDBFL17 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00661C2u)

/** \brief  C4, Read Data and Bit Flip Register */
#define MC81_RDBFL18 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00661C4u)

/** \brief  C6, Read Data and Bit Flip Register */
#define MC81_RDBFL19 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00661C6u)

/** \brief  A4, Read Data and Bit Flip Register */
#define MC81_RDBFL2 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00661A4u)

/** \brief  C8, Read Data and Bit Flip Register */
#define MC81_RDBFL20 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00661C8u)

/** \brief  CA, Read Data and Bit Flip Register */
#define MC81_RDBFL21 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00661CAu)

/** \brief  CC, Read Data and Bit Flip Register */
#define MC81_RDBFL22 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00661CCu)

/** \brief  CE, Read Data and Bit Flip Register */
#define MC81_RDBFL23 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00661CEu)

/** \brief  D0, Read Data and Bit Flip Register */
#define MC81_RDBFL24 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00661D0u)

/** \brief  D2, Read Data and Bit Flip Register */
#define MC81_RDBFL25 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00661D2u)

/** \brief  D4, Read Data and Bit Flip Register */
#define MC81_RDBFL26 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00661D4u)

/** \brief  D6, Read Data and Bit Flip Register */
#define MC81_RDBFL27 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00661D6u)

/** \brief  D8, Read Data and Bit Flip Register */
#define MC81_RDBFL28 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00661D8u)

/** \brief  DA, Read Data and Bit Flip Register */
#define MC81_RDBFL29 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00661DAu)

/** \brief  A6, Read Data and Bit Flip Register */
#define MC81_RDBFL3 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00661A6u)

/** \brief  DC, Read Data and Bit Flip Register */
#define MC81_RDBFL30 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00661DCu)

/** \brief  DE, Read Data and Bit Flip Register */
#define MC81_RDBFL31 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00661DEu)

/** \brief  E0, Read Data and Bit Flip Register */
#define MC81_RDBFL32 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00661E0u)

/** \brief  E2, Read Data and Bit Flip Register */
#define MC81_RDBFL33 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00661E2u)

/** \brief  E4, Read Data and Bit Flip Register */
#define MC81_RDBFL34 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00661E4u)

/** \brief  E6, Read Data and Bit Flip Register */
#define MC81_RDBFL35 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00661E6u)

/** \brief  E8, Read Data and Bit Flip Register */
#define MC81_RDBFL36 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00661E8u)

/** \brief  EA, Read Data and Bit Flip Register */
#define MC81_RDBFL37 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00661EAu)

/** \brief  EC, Read Data and Bit Flip Register */
#define MC81_RDBFL38 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00661ECu)

/** \brief  EE, Read Data and Bit Flip Register */
#define MC81_RDBFL39 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00661EEu)

/** \brief  A8, Read Data and Bit Flip Register */
#define MC81_RDBFL4 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00661A8u)

/** \brief  AA, Read Data and Bit Flip Register */
#define MC81_RDBFL5 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00661AAu)

/** \brief  AC, Read Data and Bit Flip Register */
#define MC81_RDBFL6 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00661ACu)

/** \brief  AE, Read Data and Bit Flip Register */
#define MC81_RDBFL7 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00661AEu)

/** \brief  B0, Read Data and Bit Flip Register */
#define MC81_RDBFL8 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00661B0u)

/** \brief  B2, Read Data and Bit Flip Register */
#define MC81_RDBFL9 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00661B2u)

/** \brief  C, Revision ID Register */
#define MC81_REVID /*lint --e(923)*/ (*(volatile Ifx_MC_REVID*)0xF006610Cu)
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Mc_Cfg_Mc82
 * \{  */

/** \brief  0, Configuration Register 0 */
#define MC82_CONFIG0 /*lint --e(923)*/ (*(volatile Ifx_MC_CONFIG0*)0xF0066200u)

/** \brief  2, Configuration Register 1 */
#define MC82_CONFIG1 /*lint --e(923)*/ (*(volatile Ifx_MC_CONFIG1*)0xF0066202u)

/** \brief  10, Memory ECC Detection Register */
#define MC82_ECCD /*lint --e(923)*/ (*(volatile Ifx_MC_ECCD*)0xF0066210u)

/** \brief  E, ECC Safety Register */
#define MC82_ECCS /*lint --e(923)*/ (*(volatile Ifx_MC_ECCS*)0xF006620Eu)

/** \brief  12, Error Tracking Register */
#define MC82_ETRR0 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0066212u)

/** \brief  14, Error Tracking Register */
#define MC82_ETRR1 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0066214u)

/** \brief  16, Error Tracking Register */
#define MC82_ETRR2 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0066216u)

