luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxMc_reg.h
/** \brief  18, Error Tracking Register */
#define MC82_ETRR3 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0066218u)

/** \brief  1A, Error Tracking Register */
#define MC82_ETRR4 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF006621Au)

/** \brief  4, MBIST Control Register */
#define MC82_MCONTROL /*lint --e(923)*/ (*(volatile Ifx_MC_MCONTROL*)0xF0066204u)

/** \brief  6, Status Register */
#define MC82_MSTATUS /*lint --e(923)*/ (*(volatile Ifx_MC_MSTATUS*)0xF0066206u)

/** \brief  8, Range Register, single address mode */
#define MC82_RANGE /*lint --e(923)*/ (*(volatile Ifx_MC_RANGE*)0xF0066208u)

/** \brief  A0, Read Data and Bit Flip Register */
#define MC82_RDBFL0 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00662A0u)

/** \brief  A2, Read Data and Bit Flip Register */
#define MC82_RDBFL1 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00662A2u)

/** \brief  B4, Read Data and Bit Flip Register */
#define MC82_RDBFL10 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00662B4u)

/** \brief  B6, Read Data and Bit Flip Register */
#define MC82_RDBFL11 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00662B6u)

/** \brief  B8, Read Data and Bit Flip Register */
#define MC82_RDBFL12 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00662B8u)

/** \brief  BA, Read Data and Bit Flip Register */
#define MC82_RDBFL13 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00662BAu)

/** \brief  BC, Read Data and Bit Flip Register */
#define MC82_RDBFL14 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00662BCu)

/** \brief  BE, Read Data and Bit Flip Register */
#define MC82_RDBFL15 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00662BEu)

/** \brief  C0, Read Data and Bit Flip Register */
#define MC82_RDBFL16 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00662C0u)

/** \brief  C2, Read Data and Bit Flip Register */
#define MC82_RDBFL17 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00662C2u)

/** \brief  C4, Read Data and Bit Flip Register */
#define MC82_RDBFL18 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00662C4u)

/** \brief  C6, Read Data and Bit Flip Register */
#define MC82_RDBFL19 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00662C6u)

/** \brief  A4, Read Data and Bit Flip Register */
#define MC82_RDBFL2 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00662A4u)

/** \brief  C8, Read Data and Bit Flip Register */
#define MC82_RDBFL20 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00662C8u)

/** \brief  CA, Read Data and Bit Flip Register */
#define MC82_RDBFL21 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00662CAu)

/** \brief  CC, Read Data and Bit Flip Register */
#define MC82_RDBFL22 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00662CCu)

/** \brief  CE, Read Data and Bit Flip Register */
#define MC82_RDBFL23 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00662CEu)

/** \brief  D0, Read Data and Bit Flip Register */
#define MC82_RDBFL24 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00662D0u)

/** \brief  D2, Read Data and Bit Flip Register */
#define MC82_RDBFL25 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00662D2u)

/** \brief  D4, Read Data and Bit Flip Register */
#define MC82_RDBFL26 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00662D4u)

/** \brief  D6, Read Data and Bit Flip Register */
#define MC82_RDBFL27 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00662D6u)

/** \brief  D8, Read Data and Bit Flip Register */
#define MC82_RDBFL28 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00662D8u)

/** \brief  DA, Read Data and Bit Flip Register */
#define MC82_RDBFL29 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00662DAu)

/** \brief  A6, Read Data and Bit Flip Register */
#define MC82_RDBFL3 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00662A6u)

/** \brief  DC, Read Data and Bit Flip Register */
#define MC82_RDBFL30 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00662DCu)

/** \brief  DE, Read Data and Bit Flip Register */
#define MC82_RDBFL31 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00662DEu)

/** \brief  E0, Read Data and Bit Flip Register */
#define MC82_RDBFL32 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00662E0u)

/** \brief  E2, Read Data and Bit Flip Register */
#define MC82_RDBFL33 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00662E2u)

/** \brief  E4, Read Data and Bit Flip Register */
#define MC82_RDBFL34 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00662E4u)

/** \brief  E6, Read Data and Bit Flip Register */
#define MC82_RDBFL35 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00662E6u)

/** \brief  E8, Read Data and Bit Flip Register */
#define MC82_RDBFL36 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00662E8u)

/** \brief  EA, Read Data and Bit Flip Register */
#define MC82_RDBFL37 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00662EAu)

/** \brief  EC, Read Data and Bit Flip Register */
#define MC82_RDBFL38 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00662ECu)

/** \brief  EE, Read Data and Bit Flip Register */
#define MC82_RDBFL39 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00662EEu)

/** \brief  A8, Read Data and Bit Flip Register */
#define MC82_RDBFL4 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00662A8u)

/** \brief  AA, Read Data and Bit Flip Register */
#define MC82_RDBFL5 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00662AAu)

/** \brief  AC, Read Data and Bit Flip Register */
#define MC82_RDBFL6 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00662ACu)

/** \brief  AE, Read Data and Bit Flip Register */
#define MC82_RDBFL7 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00662AEu)

/** \brief  B0, Read Data and Bit Flip Register */
#define MC82_RDBFL8 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00662B0u)

/** \brief  B2, Read Data and Bit Flip Register */
#define MC82_RDBFL9 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00662B2u)

/** \brief  C, Revision ID Register */
#define MC82_REVID /*lint --e(923)*/ (*(volatile Ifx_MC_REVID*)0xF006620Cu)
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Mc_Cfg_Mc83
 * \{  */

/** \brief  0, Configuration Register 0 */
#define MC83_CONFIG0 /*lint --e(923)*/ (*(volatile Ifx_MC_CONFIG0*)0xF0066300u)

/** \brief  2, Configuration Register 1 */
#define MC83_CONFIG1 /*lint --e(923)*/ (*(volatile Ifx_MC_CONFIG1*)0xF0066302u)

/** \brief  10, Memory ECC Detection Register */
#define MC83_ECCD /*lint --e(923)*/ (*(volatile Ifx_MC_ECCD*)0xF0066310u)

/** \brief  E, ECC Safety Register */
#define MC83_ECCS /*lint --e(923)*/ (*(volatile Ifx_MC_ECCS*)0xF006630Eu)

/** \brief  12, Error Tracking Register */
#define MC83_ETRR0 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0066312u)

/** \brief  14, Error Tracking Register */
#define MC83_ETRR1 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0066314u)

/** \brief  16, Error Tracking Register */
#define MC83_ETRR2 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0066316u)

